{"spell_name": "Soul Abductor", "spell_type": "Soul Corpse Magic", "spell_description": "With an opengrimoire, the user summons back a sacrificed soul and returns it to their body, removing any injuries associated with the person's death. The spell can also activate after the user's own death.[2]"}
{"spell_name": "Skin Fort", "spell_type": "Skin Magic", "spell_description": "With an opengrimoire, the user shapes and hardens their skin into cannons on various parts of their bodies. These cannons can fire off large blasts ofmana. By spreading the cannons around their body, the user can attack in multiple directions at once.[1]"}
{"spell_name": "Scale Dominate", "spell_type": "Scale Magic", "spell_description": "With an opengrimoireand purifieddevilpower, the user manifests a giant scale with a pair of weights, which enables the user to assert control over themanain their immediate vicinity. By tipping the scale in the user's favor, the user can negate any incoming spells as they draw near.[1]"}
{"spell_name": "Scale Regulate", "spell_type": "Scale Magic", "spell_description": "With an opengrimoire, the user manifests a scale and a set of weights that represent the user and the target. The scale then balances out the magic power of the two sides, shrinking the size of active spells.[1]If needed, the user can tip the balance manually and adjust the number of weights.[2]"}
{"spell_name": "Rock Fortress", "spell_type": "Rock Magic", "spell_description": "With an opengrimoire, the user creates a wall made from rock that has spikes on it.[1]"}
{"spell_name": "World End Martyr", "spell_type": "Ice Wedge Magic", "spell_description": "Using an opengrimoire, the user builds an enormous creature out of extremely sharp ice. The creature boasts a set of wings similar to an angel, strong talons, and two halo-like rings hovering above its head, with a cross replacing its face and one adorning its chest. This gigantic creature is formidable enough to decimate the battlefield with its might alone, and is capable of unleashing powerful ice beams that freeze anything in its path."}
{"spell_name": "Smoke Garden of Usurpation", "spell_type": "Smoke MagicWeakening Magic", "spell_description": "With an opengrimoire, the user releases smoke with poisonous properties which are deadly to anyone except the user and those the user does not wish to harm.[1]"}
{"spell_name": "Red Shine Mace", "spell_type": "Copper Magic", "spell_description": "The user creates a large polearm, with a large head piece. The user would then slam the head piece to a target to defeat them.[1]"}
{"spell_name": "Zetten", "spell_type": "", "spell_description": "By precisely manipulating theirki, the user builds up magic power within their own body and concentrates it into their limb. Subsequently, the user swiftly performs a physical motion, such as a punch or a kick, and explosively releases the magic power, generating a focused blast of energy from their limb. This energy's form depends on the physical motion; for example, a hand swing will generate a flying slash that is capable of slicing targets from a distance.[2]"}
{"spell_name": "Crushing Air Blast", "spell_type": "Air Magic", "spell_description": "With an opengrimoire, the user compresses a mass of air between their palms and then releases it at their target. The mass explosively decompresses upon contact, destroying anything near it.[1]"}
{"spell_name": "Bustling Lazy Vehicle", "spell_type": "Smoke MagicCreation Magic", "spell_description": "With an opengrimoire, the user generates a shroud of smoke in the shape of a vehicle similar to a cart. The cart has four wheels with the rear wheels being larger than the front wheels. The body of the cart is spacious enough to comfortable fit five people. It also has a rooftop that covers the rear-half of the body and a chimney that releases smoke.[1]The cart can rise up and travel through the air.[2]"}
{"spell_name": "Hermit's Thick Smoke", "spell_type": "Smoke Magic", "spell_description": "With an opengrimoire, the user releases a smoke that turns the user and others around them invisible.[1]It can also suppress theirmana, hiding them from even captain-class sensors; however, they can still be sensed withKi.[2]"}
{"spell_name": "Inverse Release", "spell_type": "Sealing Magic", "spell_description": "The user holds out their hand and forces an object to open. This spell could be used to force open a closed gateway[1]or a sealed soul[2]or to break apart magical bindings[3][4]or handcuffs.[5]"}
{"spell_name": "Smoke Binding Cross Prison", "spell_type": "Smoke MagicCreation Magic", "spell_description": "With an opengrimoire, the user crouches in front of the target and touches the ground with both hands. Clouds of smoke then gather and start enveloping the target until they form into a shape of a cross.[1]"}
{"spell_name": "Heavenly Prison: Faint Omen", "spell_type": "Sealing MagicHealing Magic", "spell_description": "With an opengrimoire, the user places their hands on someone and temporarily seals away their bodily damage.[1]"}
{"spell_name": "Angel Wing", "spell_type": "Wing Magic", "spell_description": "With an opengrimoire, the user creates a pair of magical wings on their back. These wings enable the user to fly at high speeds and to launch feathers.[1]"}
{"spell_name": "Thunder Arrow", "spell_type": "Compound MagicLightning MagicSteel MagicWing Magic", "spell_description": "TheSteel Magicuser creates a railgun, which theLightning Magicuser fits it with a large arrow that has a lightning bolt-shaped tip. TheWing Magicuser supports the other two from behind. Targeting is also adjustable, made easier by the Lightning Magic user's ability to sensemana.[1]"}
{"spell_name": "Angel Flapping", "spell_type": "Wing Magic", "spell_description": "With a pair ofAngel Wings, the user flies above their enemies and flaps their wings, releasing a swarm of feathers. These feathers can distract their enemies while pushing their allies towards a direction,[1]or be made sharp enough to pierce and cut enemies.[2]"}
{"spell_name": "Explosive Air Wave Palm", "spell_type": "Air Magic", "spell_description": "With an opengrimoire, the user thrusts their palm toward their target and projects a large invisible mass of air.[1]It has enough force to crush defensiveIron Magic.[2]"}
{"spell_name": "Degenerate King's Smoke Prison", "spell_type": "Smoke MagicCreation Magic", "spell_description": "With an opengrimoire, the user generates clouds of smoke that start swirling around the target and form a dome, entrapping the target.[1]The dome of smoke constantly blasts smoke towards the target, who could ultimately suffocate. Additionally, the dome itself is self replenishing every time the target tries to break free.[2]"}
{"spell_name": "Sea God's Descent", "spell_type": "Union MagicSong MagicButoh Magic", "spell_description": "While underwater, thedancerswims overhead of the target, and thesingerenhances the dancer's swords and movements. The dancer is then propelled down with tremendous force, knocking back and injuring the target. The resulting shockwave can be used to handle multiple targets.[1]"}
{"spell_name": "Sandbox", "spell_type": "Sand MagicRestraining Magic", "spell_description": "With an opengrimoire, the user concentrates a certain amount of sand to a specific location, such as around a target. The sand then forms into a cube and contains the target.[1]"}
{"spell_name": "Sand-Armored Guard", "spell_type": "Sand MagicCreation Magic", "spell_description": "With an opengrimoire, the user summons a sentry-like golem which consists entirely of sand. Additionally, the user is free to choose the location where they would like to create the golem.[1]"}
{"spell_name": "Mistilteinn Blade", "spell_type": "World Tree MagicCreation Magic", "spell_description": "With an opengrimoire, the user shapes a world tree into a sword, which has a hilt with a braided appearance and a guard formed from small branches. The user can pour their magic power into the sword and then hand it to an ally to wield.[1]"}
{"spell_name": "Mana Skin", "spell_type": "Reinforcement Magic", "spell_description": "The user creates a coating ofmanathat protects them. It is a basic technique that mostMagic Knightshave used unconsciously at one point or another. Proper training allows a mage to use it consciously and to greater effect."}
{"spell_name": "Wind Blades Shower", "spell_type": "Wind MagicCreation Magic", "spell_description": "With an opengrimoire, the user manifests dozens of blades composed solely of compressed solid wind. The blades take a shape closer to a throwing knife rather than to a blade where it does not have a handle nor a hilt.[1]"}
{"spell_name": "Magic Tree Descent", "spell_type": "World Tree Magic", "spell_description": "With an opengrimoire, the user calls forth the roots of a giant tree from the clouds overhead. From these roots, the user could craft a multitude of wooden objects, including broomsticks. Once the user is done, the roots retreat back up into the clouds.[2]"}
{"spell_name": "Sandscreen", "spell_type": "Sand Magic", "spell_description": "With an opengrimoire, the user launches a blast of sand into the opponent's eyes, temporarily blinding them.[1]"}
{"spell_name": "Sand-Armored Heavy Guard", "spell_type": "Sand MagicCreation Magic", "spell_description": "With an opengrimoire, the user summons a warrior-like golem which consists entirely of sand. Additionally, the user is free to choose the location where they would like to create the golem.[1]"}
{"spell_name": "Slicing Wind Emperor: Whirlwind", "spell_type": "Wind MagicRestraining Magic", "spell_description": "With an opengrimoireand awind sword, the user swings their sword and binds the target's limbs with whirlwinds, suspending them in midair.[1]"}
{"spell_name": "Mistilteinn Seed", "spell_type": "World Tree Magic", "spell_description": "With an opengrimoire, the user throws a seed at a target. The seed drains the target's magic and rapidly grows into a large tree around the target, immobilizing them.[1]"}
{"spell_name": "Tornado Fang", "spell_type": "Wind Magic", "spell_description": "With an opengrimoire, the user creates a large, horizontal tornado which drills through opponents and their spells. The spell is powerful enough to shatter rock and to blow away multiple opponents.[1]"}
{"spell_name": "Magic Warding Ash", "spell_type": "World Tree Magic", "spell_description": "With an opengrimoire, the user creates a giant ash tree and directs branches from it to wrap around and block spells. This spell is powerful enough to blockdevil-enhancedBone Magic.[1]"}
{"spell_name": "Swift White Hawk", "spell_type": "Wind MagicCreation Magic", "spell_description": "With an opengrimoire, the user manifests a hawk-like bird composed of wind streams and with complete avian anatomy, such as wings and talons. The hawk is capable of performing any of the user's commands as if it were a living creature.[1]"}
{"spell_name": "Slicing Wind Emperor: Mountain Retreat", "spell_type": "Wind MagicCreation Magic", "spell_description": "With an opengrimoireand awind sword, the user sends a very strong gust of wind towards their opponent, sending them flying a great distance.[1]"}
{"spell_name": "Slicing Wind Emperor: Gale", "spell_type": "Wind MagicCreation Magic", "spell_description": "With an opengrimoireand awind sword, the user plunges at their opponent with great force while surrounded by wind.[1]"}
{"spell_name": "Killing Kakara Blade", "spell_type": "Wind Magic", "spell_description": "With an openscrolland wind streaming off of their head, arms, and legs, the user flies past their opponent and, as they pass, spawns numerous wind blades that slash at the opponent from multiple angles. When boosted byZetten, these blades are capable of cutting through the scales of a monstrously large dragon.[1]"}
{"spell_name": "Towering Tornado", "spell_type": "Wind Magic", "spell_description": "With an opengrimoire, the user generates a tornado near the target. The tornado's destructive power is enough to send the target flying a considerable distance without letting any chance of a counterattack.[1]"}
{"spell_name": "Thief's Wind Cloud", "spell_type": "Wind Magic", "spell_description": "Once the spell is activated, the user focuses a considerable number of wind streams in a single place. Once they are gathered, the user then rides on top of it and uses it as a vehicle. Subsequently, the user does not need to use any hand gestures to maneuver the wind cloud's movement.[1]"}
{"spell_name": "Heavenly Wind Ark", "spell_type": "Wind MagicCreation Magic", "spell_description": "With an opengrimoire, the user manifests a gust of wind and then shape it into an ark-like vessel. The floating ark has enough density that the user is able to stand on top of it and use it as a transportation device.[1]"}
{"spell_name": "Slicing Wind Emperor: Wintry Wind", "spell_type": "Wind MagicCreation Magic", "spell_description": "With an opengrimoireand awind sword, the user creates multiple swords of wind that they send towards their opponents.[1][2]"}
{"spell_name": "Gale White Bow", "spell_type": "Wind Magic", "spell_description": "With an opengrimoire, the user pulls back their right arm with an open palm, generates a large bow made of wind, and creates six large arrows that are fired at a target. The arrows can block an opponent's attack and then split into smaller arrows that continue toward the target."}
{"spell_name": "Dracaena Formation", "spell_type": "World Tree Magic", "spell_description": "With an opengrimoire, the user touches their hand to the ground and summons multiple large roots to wrap around a target, squeezing and twisting the target until they break.[1]"}
{"spell_name": "Demon-Dweller Sword: Spirit Light Tree", "spell_type": "Union MagicSword MagicWorld Tree Magic", "spell_description": "TheWorld Tree Magicuser holds out their hands and creates a seed that sprouts into several twisting branches. TheSword Magicuser places a hand on the other's back and then uses theDemon-Dweller Swordto create connections to their allies. These connections are then tied together into a gigantic shining tree."}
{"spell_name": "Piercing Tornado Needle", "spell_type": "Wind MagicCreation Magic", "spell_description": "With an opengrimoire, the user manifests a miniature vortex of wind and elongates the vortex to create needle-shaped spears to attack the target. In addition, the user can create multiple vortexes to attack multiple targets at once.[1]"}
{"spell_name": "Slicing Wind Emperor", "spell_type": "Wind MagicCreation Magic", "spell_description": "With an opengrimoire, the user creates a blade composed of wind around an object.[2]This sword can be used in close-range combat or for the basis of longer range spells.[3]"}
{"spell_name": "Budding of Yggdrasil", "spell_type": "World Tree MagicHealing Magic", "spell_description": "With an opengrimoire, the user sprouts a massive tree that spreads out over an area and wraps its branches around injured people, lifting them up and healing them. It is capable of rapidly treating a large number of people with an array of different injuries.[1]"}
{"spell_name": "Mist Spider Binding Thread", "spell_type": "Mist MagicRestraining Magic", "spell_description": "With an opengrimoire, the user launches a web-shaped thread composed of mist towards the target. The web then could be used to capture and restrain the target.[1]"}
{"spell_name": "Great Tree Mistilteinn", "spell_type": "World Tree Magic", "spell_description": "With an opengrimoire, the user spreads roots over a wide area.[1]These roots absorb the mana of everyone within the area.[2]Once enough mana is absorbed, the user creates a large tree that can capture the enemy and engulf a city.[3]"}
{"spell_name": "Leo Palma", "spell_type": "Fire MagicRestraining Magic", "spell_description": "With an opengrimoire, the user conjures several lion's palms composed entirely of fire around their target."}
{"spell_name": "Sylph's Breath", "spell_type": "Wind MagicSpirit Magic", "spell_description": "With an opengrimoire, the user summonsSylph, the wind spirit, and then launches an enormous bullet of concentrated wind streams with the spirit's assistance.[1]"}
{"spell_name": "Crescent Kamaitachi", "spell_type": "Wind Magic", "spell_description": "With an opengrimoire, the user extends his arms outward and forms a thin crescent-shaped blade of wind, which is sent towards the target.[1]"}
{"spell_name": "Spirit's Hushed Dance", "spell_type": "Wind MagicSpirit Magic", "spell_description": "Afterabsorbing an elemental spirit, the usertakes control of the surrounding mana, enabling them to predict and evade attacks, even those fromLight Magic. The user appears to dance along a stream of wind.[1]"}
{"spell_name": "Spirit Storm", "spell_type": "Wind MagicSpirit Magic", "spell_description": "With an opengrimoireand afterabsorbing an elemental spirit, the user concentrates a large amount of mana in the palm of their hand and then releases the mana in a dense beam of swirlingWind Magic.[1]"}
{"spell_name": "Spirit of Notos", "spell_type": "Wind MagicSpirit MagicCreation Magic", "spell_description": "Afterabsorbing an elemental spirit, the user holds out their right hand and shapes a shield out of condensed wind. The shield is decorated with wings and emblazoned with a four-leaf clover. The shield utilizes streams of winds to help push back against any blocked attack.[1]"}
{"spell_name": "Spirit of Zephyr", "spell_type": "Wind MagicSpirit MagicCreation Magic", "spell_description": "Afterabsorbing an elemental spirit, the user condenses externalmanainto a large, two-handed sword. Since it is partially composed of external mana, it can take on the properties of that mana.[1]"}
{"spell_name": "Spirit of Euros", "spell_type": "Wind MagicSpirit MagicCreation Magic", "spell_description": "Afterabsorbing an elemental spirit, the user charges a large amount of magic power and condenses it into a recurve bow and arrow.[1]When fired, the arrow is extremely fast and powerful, cleanly piercing through adevil-boosted body without issue.[2]"}
{"spell_name": "Sea Serpent Twine", "spell_type": "Water MagicRestraining Magic", "spell_description": "With an opengrimoire, the user launches a serpent-shaped water thread towards the target. The serpent forms a coil that is ready to restrain the target.[1]"}
{"spell_name": "Never-Never Land", "spell_type": "Union MagicStar MagicWind MagicSpirit Magic", "spell_description": "With opengrimoiresandWindSpirit Magicassimilated into their left arm, the usertakes control of the surrounding manaand creates a dome ofstarsthat rotate around the enclosed area. At the same time,Sylphblows a star-decorated horn and spreads small clones of herself throughout the area."}
{"spell_name": "Sheep Horn Snag", "spell_type": "Restraining Magic", "spell_description": "With an opengrimoire, the user creates a pair of sheep horns underground. The horns break out of the ground underneath the target's feet and wrap around their legs.[1]"}
{"spell_name": "Liable Tempest", "spell_type": "Wind MagicSpirit MagicRestraining Magic", "spell_description": "Afterabsorbing an elemental spirit, the user flies in a circle around the target and increases their speed until a vortex of wind is created. The user then compresses the vortex into a tight cocoon and fastens it with several wind streams, restraining the target."}
{"spell_name": "Saint Spirit of Zephyr", "spell_type": "Wind MagicSpirit MagicCreation Magic", "spell_description": "Afterabsorbing an elemental spiritand creatingSpirit of Zephyr, the user synchronizes withSylphwho condenses more magic power into the sword. When the resonance between user and spirit nears 100%, the sword reaches Saint Stage and is capable of counteractingdevilpower."}
{"spell_name": "Dark Binding", "spell_type": "Dark MagicRestraining Magic", "spell_description": "With an opengrimoire, the user creates ropes composed of darkness which wrap around the target, restricting their movements and magic.[1][2]"}
{"spell_name": "Flame Rope Solid Binding Formation", "spell_type": "Fire MagicRestraining Magic", "spell_description": "With and opengrimoire, the user creates a rope composed of fire which wraps around the target. The spell makes use of fire sources from the surrounding area, so it is commonly used after activating other fire-based spells.[1]"}
{"spell_name": "Flash Bog", "spell_type": "Mud MagicRestraining Magic", "spell_description": "With an opengrimoire, the user covers the ground underneath an opponent with mud and turns the area into a small bog. The mud clings to the opponent, restricting movements.[1]"}
{"spell_name": "Chrono Stasis Grigora", "spell_type": "Time MagicRestraining Magic", "spell_description": "After taking control of the surroundingmana, the user creates an area in which any enemy spell is automatically caught withChrono Stasis. This spell is even capable of catching extremely fast magic, likeLight Magic."}
{"spell_name": "Chrono Stasis", "spell_type": "Time MagicRestraining Magic", "spell_description": "With their hands in front of them with the palms facing upward, the user spreads their arms and manifests a sphere around the target. The sphere has a ring around its orbit with Roman numerals on it. The user is able to generate multiple spheres to restrain several targets, for a sphere could only contain a single person.[1]"}
{"spell_name": "Magic Pollen", "spell_type": "Plant MagicReinforcement Magic", "spell_description": "With an opengrimoire, the user extends their hands toward a target, and vines grow from the user to the target. At the ends of the vines are flowers which release pollen that increase the strength of the target's magical power.[1]"}
{"spell_name": "Base Run Gamble", "spell_type": "Fire MagicReinforcement Magic", "spell_description": "With an opengrimoire, the user creates a pair of shoes made from fire. They increase the wearer's running speed.[1]"}
{"spell_name": "Sand-Armored Dreadnought Guard", "spell_type": "Sand MagicCreation Magic", "spell_description": "With an opengrimoire, the user summons a giant, heavily armored sand golem that wields a pair of knives with half-moon blades. This spell boasts maximum offensive and defensive strength.[1]"}
{"spell_name": "Crushing Sand Clod", "spell_type": "Sand Magic", "spell_description": "With an opengrimoire, the user generates a large block of sand and drops it on the target. This sand can absorb water.[1]"}
{"spell_name": "Variable Hardness Prison", "spell_type": "Sandstone Magic", "spell_description": "With an opengrimoire, the user generates a large block of sandstone and moves toward the target. The block dissolves into sand and reforms around the target. Once hardened, the target is left to suffocate.[1]"}
{"spell_name": "Spirit of Boreas", "spell_type": "Wind MagicSpirit MagicCreation Magic", "spell_description": "Afterabsorbing an elemental spirit, the user shapes a halberd out of condensed wind. It releases streams of wind that are capable of shattering and disintegratingdevil-reinforcedBone Magic, as well as drilling into a target.[1]"}
{"spell_name": "Leg Strength Boost", "spell_type": "Reinforcement Magic", "spell_description": "The user concentrates magic in their legs and increases their leg strength, boosting their running speed and jumping distance.[1][2]"}
{"spell_name": "Snow Man Safehouse", "spell_type": "Snow MagicCreation Magic", "spell_description": "With an opengrimoire, the users creates eight snowmen which hover over an area. They maintain a barrier of snow that hides the enclosed area from outside view, as well as masking the use of magic within the area.[1]"}
{"spell_name": "Rock Storm", "spell_type": "Sandstone Magic", "spell_description": "With an opengrimoire, the user concentrates sand into a swirling sphere, thrusts their hand toward the target, and projects the swirling sand in a twister. The sand twister is capable of destroying a large, solid crystal.[1]"}
{"spell_name": "Rock Fall", "spell_type": "Sandstone Magic", "spell_description": "With an opengrimoire, the user creates a series of giant stalagmites that thrust up from the ground and crash into the target.[1]"}
{"spell_name": "Miniature Garden of Illusory Snow", "spell_type": "Snow Magic", "spell_description": "With an opengrimoire, the user fills an enclosed space with enchanted snow. Those who come into contact with the snow slowly lose their senses and start to move sluggishly until eventually falling asleep.[1]"}
{"spell_name": "Snow Friends", "spell_type": "Snow MagicCreation Magic", "spell_description": "With an opengrimoire, the users creates multiple snowmen of different sizes and builds. The snowmen's eyes, noses, and mouths are all made of rocks.[1]"}
{"spell_name": "Snow Lime Rock", "spell_type": "Snow MagicRestraining Magic", "spell_description": "With an opengrimoire, the user creates a large coral-like structure of snow around the target. The snow hardens and the target is immobilized.[1]"}
{"spell_name": "Elemental Quintet", "spell_type": "Compound MagicLight MagicSnow MagicPainting MagicSandstone MagicWing Magic", "spell_description": "TheLight Magicuser creates a giantLight Sword of Judgment, and the four other mages hold out a hand and create streams from their different magic types. Once complete, the sword is launched at the target and the streams swirl around the sword.[1]"}
{"spell_name": "Unite Mode: Gallus", "spell_type": "Shadow Magic", "spell_description": "With an opengrimoire, the userassimilatesWalgnerinto their body throughShadow Magic. The spell enables the user to contain and control the power of thedevil, dramatically increasing their own magic power and capabilities."}
{"spell_name": "Snow Cry", "spell_type": "Snow Magic", "spell_description": "With an opengrimoire, the user releases streams of snow from their palms.[1]"}
{"spell_name": "Silver Fox in Blood-Dyed Robes", "spell_type": "Snow Magic", "spell_description": "With an openscroll, the user assimilatesSnow Magicinto their body, turning their hair silver and growing foxlike ears and tails. The cold magic spreads frost on the user's surroundings. When also boosted byZetten, the user's attacks in this form are capable of cutting through the skull of a monstrously large dragon.[1]"}
{"spell_name": "Shadow Corridor", "spell_type": "Shadow Magic", "spell_description": "With an opengrimoire, the user faces a doorway and extends the shadow from under their feet to the doorway, covering the entrance and forming a long hallway. At the other end of the hallway, an opening forms to the desired location. This spell can be used to cross great distances in seconds and allows for the movement of several people at once.[1]"}
{"spell_name": "Unclimbed Ice Wall", "spell_type": "Snow Magic", "spell_description": "With an opengrimoire, the user raises their hands out in front of them and creates a thick sheet of ice.[1]"}
{"spell_name": "Unite Mode: Felis", "spell_type": "Shadow Magic", "spell_description": "With an opengrimoire, the userassimilatesPlumedeinto their body throughShadow Magic. The spell enables the user to contain and control the power of thedevil, dramatically increasing their own magic power and capabilities."}
{"spell_name": "Unite Mode: Canis × Equus", "spell_type": "Shadow Magic", "spell_description": "With an opengrimoire, the userassimilatesGimodeloandSlotosinto their body throughShadow Magic. The spell enables the user to contain and control the power of twodevils, dramatically increasing their own magic power up to the level of a highest-ranking devil."}
{"spell_name": "Unite Mode: Canis", "spell_type": "Shadow Magic", "spell_description": "With an opengrimoire, the userassimilatesGimodelointo their body throughShadow Magic. The spell enables the user to contain and control the power of thedevil, dramatically increasing their own magic power and capabilities."}
{"spell_name": "Unite Mode: Canis × Felis", "spell_type": "Shadow Magic", "spell_description": "With an opengrimoire, the userassimilatesGimodeloandPlumedeinto their body throughShadow Magic. The spell enables the user to contain and control the power of twodevils, dramatically increasing their own magic power up to the level of a highest-ranking devil."}
{"spell_name": "Kids' Playground", "spell_type": "Union MagicShadow MagicDark Magic", "spell_description": "Aftertaking controlof the surroundingmana, the users combine their magic to create a large pool of shadow on the ground and to enlarge theBlack Moonoverheard. Several building facades of various designs then rise up from the shadow on the ground."}
{"spell_name": "Heaven's Shadow Second Sight", "spell_type": "Shadow Magic", "spell_description": "Aftermerging with Plumede, the user concentrates the devil's power into their eyes, enabling them to perceivemanaand to peer through shadows to other locations.[1]"}
{"spell_name": "Unite Mode: Gallus × Felis", "spell_type": "Shadow Magic", "spell_description": "With an opengrimoire, the userassimilatesWalgnerandPlumedeinto their body throughShadow Magic. The spell enables the user to contain and control the power of twodevils, dramatically increasing their own magic power up to the level of a highest-ranking devil."}
{"spell_name": "Doppelganger", "spell_type": "Union MagicShadow MagicDark Magic", "spell_description": "After slipping into a shadow, theDark Magicuser and theShadow Magicuser emerge from another shadow behind an opponent and simultaneously attack, with the Shadow Magic user mirroring the attack of the Dark Magic user.[1]The effectiveness of the copied attack is unknown as it is stopped before causing any damage."}
{"spell_name": "Sea God Slash", "spell_type": "Union MagicSong MagicButoh Magic", "spell_description": "With opengrimoires,Song Magicis used to enhanceButoh Magic, and the magics combine to create large magical auras around the dancer's swords. When the dancer swings their swords, powerful shockwaves and flying slashes are produced.[1]"}
{"spell_name": "Monument of Atonement", "spell_type": "Shadow Magic", "spell_description": "The final sealing of the tomb"}
{"spell_name": "Unite Mode: Equus", "spell_type": "Shadow Magic", "spell_description": "With an opengrimoire, the userassimilatesSlotosinto their body throughShadow Magic. The spell enables the user to contain and control the power of thedevil, dramatically increasing their own magic power and capabilities."}
{"spell_name": "Dark Garden Invitation", "spell_type": "Shadow Magic", "spell_description": "With an opengrimoire, the user places their hand on the floor of a room, and shadows spread out, covering the floor and extending up the walls. Hands of shadow rise up from the floor, grab onto anyone else in the room, drag them down into the shadow, and drop them into another chamber.[1]"}
{"spell_name": "Eternal Prison", "spell_type": "Sealing Magic", "spell_description": "The user holds out their hands and creates a clear cube around a target, trapping them for centuries. This spell requires a large amount of magic power."}
{"spell_name": "Closed Sorrow", "spell_type": "Sealing MagicHealing Magic", "spell_description": "With an opengrimoire, the user holds out their hands over a wound and closes it with magic. This spell can reattach severed limbs.[1]"}
{"spell_name": "Dark Prison Hunting Ground", "spell_type": "Shadow Magic", "spell_description": "Aftertaking controlof the surroundingmana, the user spreads out their shadow, shrouding everything in shadow and cutting off all light. The user'skiis also hidden, allowing them andtheir clonesto strike their opponent without being sensed.[1]"}
{"spell_name": "Trinity Seal Magic", "spell_type": "Seal Magic", "spell_description": "Three mages surround their target and create multiple rings of writing that encompass the target and seal it away."}
{"spell_name": "Rhythm Cushion", "spell_type": "Song Magic", "spell_description": "With an opengrimoire, the user sings and creates a large cushion of air, which is capable of stopping a person mid-air without injuring them.[1]"}
{"spell_name": "Mother Lullaby", "spell_type": "Song Magic", "spell_description": "With an opengrimoire, the user sings a lullaby, which puts a target to sleep.[1]However, it could be blocked with a defensive spell.[2]"}
{"spell_name": "Heal Lullaby", "spell_type": "Song MagicHealing Magic", "spell_description": "While the user sings, water bubbles appear in the air and gather around injuries, healing them and recovering stamina.[1]"}
{"spell_name": "Air Blockade", "spell_type": "Air Magic", "spell_description": "With an opengrimoire, the user holds out their hands and creates a solid wall of air. The wall can be projected forward to disperse an incoming attack[1]or be shaped into a sphere to protect from multiple directions.[2]"}
{"spell_name": "Destruction Beat", "spell_type": "Song Magic", "spell_description": "With an opengrimoire, the user sings and their voice is amplified into destructive soundwaves.[1]"}
{"spell_name": "Strong Bow", "spell_type": "Rock Magic", "spell_description": "With an opengrimoire, the user creates a large crossbow from rock that is capable of firing magic bolts over long distances. The crossbow has a large blade attached to the front and six spikes along the limbs, and the string is made ofmana. The crossbow is mounted on a rock structure that can be manipulated to adjust angle and direction.[1]"}
{"spell_name": "Torment Canceler", "spell_type": "Memory Magic", "spell_description": "With an opengrimoire, the user creates a crossbow mounted on their forearm. This crossbow fires bolts that erase the short-term memory of anyone they strike. Multiple bolts can be fired in rapid succession.[1]"}
{"spell_name": "Temple Shuffle", "spell_type": "Game Magic", "spell_description": "With an opengrimoire, the user raises their arms and summons a certain number of individuals. The user then transports the individuals along with an equal number of others to random locations.[1]"}
{"spell_name": "Sticky Salamander", "spell_type": "Gel Magic", "spell_description": "With an opengrimoire, the user creates a salamander composed solely of a gel material. Additionally, the user could alter the size of the salamander at will.[1]"}
{"spell_name": "Origin Flash Barrage", "spell_type": "Sword Magic", "spell_description": "The user swings their sword and releases multiple giant slashes that cut anything in their path.[1]"}
{"spell_name": "Red Thread of Fate", "spell_type": "Thread Magic", "spell_description": "With an opengrimoire, the user creates a cat from red thread.[1]By simply touching a target, the cat can change the outcome of a subsequent event to something more favorable for the user.[2][3]The cat only protects those about whom the user cares;[4][5]however, someone physically near the user can benefit from the changed fates.[6]The cat also only reacts to direct attacks so the user and their allies can be transported, restrained, or indirectly attacked while the spell is active.[7][8][9]"}
{"spell_name": "Arresting Dark Weave", "spell_type": "Thread Magic", "spell_description": "With an opengrimoire, the user weaves a large spider web out of thread. When an opponent touches the web, the threads wrap around them and bind them to the web.[2]"}
{"spell_name": "Dancing Doll", "spell_type": "Thread Magic", "spell_description": "With an opengrimoire, the user wraps threads around the target's wrists and ankles and forces them to move as the user wishes.[1]"}
{"spell_name": "Chrono Anastasis", "spell_type": "Time Magic", "spell_description": "The user creates a clock face that expands and covers the targeted area. Within that area, the user is able to stop and rewind time, which is reflected in the movements of the hands on the clock.[1]"}
{"spell_name": "Surging Waves", "spell_type": "Water Magic", "spell_description": "With an opengrimoire, the user kneels and places their hands on the ground, and a flood of water surges forward and crashes into the target.[1]"}
{"spell_name": "Valkyrie Dress", "spell_type": "Water MagicCreation Magic", "spell_description": "With an opengrimoire, the user creates a suit of armor around their body. The suit is made of water and includes a breastplate, faulds, spaulders, vambraces, chausses, and a tiara. Wing-like ornaments cover their ears and two large wing-like ornaments hang off the lower back. In their right hand is a lance made of spiraling water.[1]"}
{"spell_name": "Operation", "spell_type": "Modification Magic", "spell_description": "With an opengrimoire, the user holds out their hands and magical strands extend from their fingers. These strands can then manipulate whatever they touch.[1]The main two functions are disassembly 「分解bunkai」, which breaks apart structures and creatures into pieces,[2]and reassembly 「結合ketsugō」, which recombines things as the user wishes, with stitches forming along the seams between the pieces.[3]"}
{"spell_name": "Quartile Scutum", "spell_type": "Star Magic", "spell_description": "With an opengrimoire, the user generates four stars and arranges them into a rectangle. Beams of light connect the stars along the edges of the rectangle, forming a defensive barrier that is capable of withstanding devil-powered magic.[1]"}
{"spell_name": "Tainted Culvert Wyrm", "spell_type": "Water Magic", "spell_description": "With an opengrimoire, the user creates a large serpentine dragon out of water and, with a gesture, directs the creature toward their target.[1]"}
{"spell_name": "Violent Rotating Lance", "spell_type": "Steel MagicCreation Magic", "spell_description": "With an opengrimoire, the user summons a huge lance with a spiral head. The lance rotates at a high speed and can be launched towards a target.[1]"}
{"spell_name": "Ultra Giant Bull", "spell_type": "Recombination Magic", "spell_description": "With an opengrimoire, the user takes control of a nearby larger structure and combines it into their magic house, creating an even more gigantic bull. The process can be aided by the new parts beingtransmutedinto the same materials as the magic house. This requires a large amount of magic power due to the amount of material being manipulated.[1]"}
{"spell_name": "Sea God's Shield", "spell_type": "Water MagicCreation Magic", "spell_description": "The user manifests an enormous watery shield that levitates near the user. Despite being made of water, this shield can blockLightning Magicspells.[1]"}
{"spell_name": "Sea Serpent's Bellow", "spell_type": "Water MagicCreation Magic", "spell_description": "With an opengrimoire, the user holds out their arm and creates a spinning torrent of water with the shape of a large serpent's head. It is strong enough to divert ademon's magical beam.[1]"}
{"spell_name": "Spatial Mana Domination", "spell_type": "Spatial Magic", "spell_description": "Smaller cubes can catch individual attacks."}
{"spell_name": "Stone Rain", "spell_type": "Stone MagicCreation Magic", "spell_description": "With an opengrimoire, the user holds their hands out in front and manifests several chunks of stone in the air around themselves. These stones can then be launched at a target.[1]"}
{"spell_name": "Myriad Black", "spell_type": "Spatial Magic", "spell_description": "With an opengrimoire, the user manifests multiple portals in front of themselves that connect to portals that have manifested around their target. The user would then fireMagic Bulletsinto the portals to attack their target from all directions.[1]"}
{"spell_name": "Quartile Hasta", "spell_type": "Star Magic", "spell_description": "With an opengrimoire, the user converges the light from four stars into a singular beam, generating a larger and stronger attack.[1]"}
{"spell_name": "Fallen Angel Gate", "spell_type": "Spatial Magic", "spell_description": "With an opengrimoire, the user opens their hand as if opening a hole at the direction where the gate should be opened. At that moment, a hole appears and creates a similar hole at the desired location.[1]The user can only create portals to places they have visited beforehand or can actively see.[2][3]"}
{"spell_name": "The Raging Black Bull", "spell_type": "Recombination Magic", "spell_description": "With an opengrimoire, the user rearranges a magic house into the shape of a giant bull that they can control.[1]"}
{"spell_name": "Princess-Healing Flower Robe", "spell_type": "Plant MagicHealing Magic", "spell_description": "With an opengrimoire, the user is covered by vines and flowers, forming a dress. The dress has a pair of wing-like ornaments which are also composed of leaves and flowers."}
{"spell_name": "Spatial Rupture", "spell_type": "Spatial Magic", "spell_description": "By swinging theDemon Sword Dainsleif, the user creates flying slashes of offensive Spatial Magic that carve through space, erasing whatever they contact.[1]"}
{"spell_name": "Magic Flower Guidepost", "spell_type": "Plant MagicCreation Magic", "spell_description": "With an opengrimoire, the user points a finger to a location and multiple vines gather around the area of that location and start to intertwine with each other. Flower petals sprout from the tip of the intertwining vines. The flower petals are light-colored with several dark-colored spots covering the area.[1]The flower could also be created directly from the user'smana.[2]"}
{"spell_name": "Unopening Red Room", "spell_type": "Spatial MagicCreation Magic", "spell_description": "With an opengrimoire, the user slams their hands on the ground and sends of wave of magic at a target. Upon contact, the target is teleported into a large red cube. The only means of escape is defeating the user of the spell.[1][2]"}
{"spell_name": "Sacred Mana Domination", "spell_type": "Spatial Magic", "spell_description": "With purifieddevilpower, the user holds out their hand and castsSpatial Mana Domination, encompassing one or more targets. The cube not only dissolves the opponents' spells but also traps the opponents within the separate space, blocking any escape.[1]"}
{"spell_name": "Dream Healing Flower Basket", "spell_type": "Plant MagicHealing Magic", "spell_description": "With an opengrimoire, the user summons countless vines and uses them to form a cradle around the user or another target. The cradle is spherical with a flower bud at the top and glowing lilies surrounding it. Additionally, the cradle is filled with countless flower petals that envelop the users.[1]"}
{"spell_name": "Violett Schirm", "spell_type": "Poison Magic", "spell_description": "With an opengrimoire, the user holds out their hand and generates a large curtain of poison liquid. This curtain could be used to shield a target from an attack.[1]"}
{"spell_name": "Magic Cannon Flower", "spell_type": "Plant Magic", "spell_description": "With an opengrimoire, the user creates a large flower and, from an opening of the petals, launches a powerful beam of concentratedmana."}
{"spell_name": "Verbotenes Obst", "spell_type": "Poison Magic", "spell_description": "With an opengrimoire, the user holds their hands apart and creates a large mass of liquid poison between them. The mass is then launched at the target.[1]"}
{"spell_name": "Princess-Healing Flower Paradise", "spell_type": "Plant MagicHealing Magic", "spell_description": "With an opengrimoireand while wearingPrincess-Healing Flower Robe, the user creates a largenatural mana arrayand extends small roots out along the ground within the circle. Flowers sprout from the roots near injured people."}
{"spell_name": "Flower on the Roadside", "spell_type": "Plant Magic", "spell_description": "With an opengrimoire, the user holds out their hand, and a root rises up out of the ground and whips the target.[1]"}
{"spell_name": "Evergreen Vida Valtoria", "spell_type": "Plant Magic", "spell_description": "With an opengrimoire, the user creates a largenatural mana arrayon the ground, from which multiple vines sprout. These vines can grow to enormous lengths and be used to pierce or restrain a target.[1]"}
{"spell_name": "Basilisk's Breath", "spell_type": "Poison MagicCreation Magic", "spell_description": "With an opengrimoire, the user shapes a large mass of liquid poison into a giant serpentine monster which exhales a poisonous mist. The poison causes debilitating tremors, foaming at the mouth, and dark rashes on the skin.[1]"}
{"spell_name": "Flower of Truth", "spell_type": "Plant MagicCreation Magic", "spell_description": "With an opengrimoire, the user wraps a target with thick vines, immobilizing them. A flower opens in front the victim's face and has a mouth at its center. This spell forces the victim to confess the truth through the flower's mouth.[1]"}
{"spell_name": "Control Magic Grass", "spell_type": "Plant Magic", "spell_description": "The user plants a special seed within an opponent's spell. When the grass sprouts, the user is able to take control of the affected spell."}
{"spell_name": "Fallen Angel Flapping", "spell_type": "Spatial Magic", "spell_description": "With an opengrimoire, the user creates a mass of Spatial Magic and launches it at an opponent, who, upon contact, is forcibly teleported to another location.[1][2]The user could hit themselves with the spell in order to move themselves into a more advantageous position.[3]"}
{"spell_name": "Door of Fate", "spell_type": "Compound MagicSpatial Magic", "spell_description": "TheSpatial Magicuser stands in the center of a large, complexrune arrayand faces an upright stone circle on the edge of the array. Numerous additional mages stand in a circle around the array and lend their magic power, enabling the Spatial Mage to open a portal to a location far beyond their normal range.[1]"}
{"spell_name": "Curse-Worker's Neighbor", "spell_type": "Poison MagicCurse Magic", "spell_description": "With an opengrimoire, the user places their hand on someone who has beencursedand enables that person to better control the effects of their curse."}
{"spell_name": "Dwelling of the Poison Cloud", "spell_type": "Poison MagicCurse Magic", "spell_description": "With an opengrimoire, the user holds out their hands and generates a large stream of poison gas. This stream could easily corrode any plant life it touches.[1]"}
{"spell_name": "Demon Sword Dainsleif", "spell_type": "Union MagicBone MagicSpatial Magic", "spell_description": "The user creates abone swordand then coats the blade in offensiveSpatial Magic. Swinging the sword can createflying slashes of offensive Spatial Magic.[1]"}
{"spell_name": "Archangel Shootdown", "spell_type": "Spatial Magic", "spell_description": "With an opengrimoire, the user creates spheres of Spatial Magic and launches them at an opponent. The spheres will erase anything that touches them; however, they can be countered by other Spatial Magic[2][3]orAnti Magic.[4]"}
{"spell_name": "Endless Ice Fangs", "spell_type": "Union MagicIce MagicSpatial Magic", "spell_description": "TheSpatial Magicuser touches their fingertips together and opens a spatial portal next to a target, through which theIce Magicuser spawns a spiky iceberg. The numerous icicles inflict blunt, cutting, and piercing damage. This spell could also be used to target multiple opponents at once by creating additional portals and ice."}
{"spell_name": "Aufwachen Dachs", "spell_type": "Poison MagicCurse Magic", "spell_description": "With an opengrimoire, the user creates multiple badgers composed of poison. These badgers are strong enough to chew through the limbs of magically reinforced corpses.[1]"}
{"spell_name": "Different Dimension Sphere", "spell_type": "Spatial Magic", "spell_description": "With an opengrimoire, the user extends their arms up and outwards and creates a large spherical barrier around the target, preventing escape.[1]"}
{"spell_name": "Crevice Men", "spell_type": "Spatial MagicCreation Magic", "spell_description": "Within anUnopening Red Room, the user creates human-shaped figures from the floor of the room. These figures hold various weapons, like swords and spears.[1][2]"}
{"spell_name": "Blackout", "spell_type": "Spatial Magic", "spell_description": "Before activating the spell, the user marks specific areas for activation and destination. After the target enters a marked area, the user activates the spell and a black substance spreads out beneath the target's feet, envelopes the area, and transports the target to another location."}
{"spell_name": "Archangel Destruction", "spell_type": "Spatial Magic", "spell_description": "With an opengrimoire, the user creates a large mass of Spatial Magic and launches it at an opponent. Like other offensive Spatial Magic, this spell carves away anything that comes into contact with it.[1]"}
{"spell_name": "Mana Corkscrew", "spell_type": "Recombination Magic", "spell_description": "While manipulatingThe Raging Black Bull, the user rotates the arm and delivers a spinning punch to a target.[1]"}
{"spell_name": "Zofnir's Fingers", "spell_type": "Poison Plant Magic", "spell_description": "After creatingZofnir's Garden of Lingering Burns, the user sends vines to stab and skewer targets. The vines are sturdy enough to tunnel under the ground and take enemies from behind.[1]"}
{"spell_name": "Zofnir's Breath", "spell_type": "Poison Plant Magic", "spell_description": "After creatingZofnir's Garden of Lingering Burns, the user can spew dark clouds from the flowers. These poisonous clouds are also dense enough to obscure visibility.[1]"}
{"spell_name": "Mana Rocket Punch", "spell_type": "Recombination Magic", "spell_description": "While manipulatingThe Raging Black Bull, the user launches a fist at a target. The hand could be recalled to the main structure.[1]"}
{"spell_name": "Zofnir's Garden of Lingering Burns", "spell_type": "Poison Plant Magic", "spell_description": "With an opengrimoire, the user spawns a variety of poisonous and carnivorous plants from the ground. People struck by the vines are immobilized by a burning poison.[1]Thevinescan tunnel under the ground and take enemies from behind, and some of the flowers can spewdark cloudsthat obscure visibility.[2]"}
{"spell_name": "Spring of Restriction", "spell_type": "Painting Magic", "spell_description": "With an opengrimoire, the user manifests a paint brush and a palette and uses the paint brush to manipulate paint from the palette to capture a target in a spring-like well.[1]"}
{"spell_name": "Twilight of Valhalla", "spell_type": "Painting Magic", "spell_description": "With an opengrimoire, the user manifests a paint brush and a palette and, with a swipe of the brush, creates a multistory building and winged, female warriors to defend the user and anyone else in the building. The roof is decorated with shields of various shapes and designs, and the warriors are armored and carry shields and lances.[1]"}
{"spell_name": "The Mini Bull", "spell_type": "Recombination Magic", "spell_description": "With an opengrimoire, the user rearranges part of a magic house into a miniature version ofThe Raging Black Bull. This version is capable of flight by expellingmanafrom the rear section.[1]"}
{"spell_name": "Souterrain Groundswell", "spell_type": "Painting Magic", "spell_description": "With an opengrimoire, the user manifests a paint brush and a palette and, with a swipe of the brush, creates several humanoid figures that ride waves of dirt. The figures crash into a target, covering them in dirt.[1]"}
{"spell_name": "Master of Valhalla", "spell_type": "Painting Magic", "spell_description": "With an opengrimoire, the user manifests a paint brush and a palette and, with a swipe of the brush, creates a giant, bearded man with a winged helmet, armor, and spear. Once created, the giant can raise his hands to summon multiple tornados, which capture and tear apart opponents.[1]"}
{"spell_name": "Four-Headed Lindworm", "spell_type": "Painting Magic", "spell_description": "With an opengrimoire, the user manifests a paint brush and a palette and, with a swipe of the brush, creates a large serpentine creature with four heads.[1]The heads could release different elemental blasts from their mouths.[2]"}
{"spell_name": "Souterrain Giant", "spell_type": "Painting Magic", "spell_description": "With an opengrimoire, the user manifests a paint brush and a palette and, with a swipe of the brush, creates the upper body of a giant humanoid that is rising from the ground. Although it is made of dense earth, it can be broken apart if hit with an attack of sufficient force.[1]"}
{"spell_name": "Souterrain Giant's Strong Arm", "spell_type": "Painting Magic", "spell_description": "With an opengrimoire, the user manifests a paint brush and a palette and, with a swipe of the brush, creates a giant humanoid that is partially risen from the ground. The giant then throws a punch at the target.[1]"}
{"spell_name": "Sirène's Game", "spell_type": "Painting Magic", "spell_description": "With an opengrimoire, the user manifests a paint brush and a palette and, with a swipe of the brush, creates several mermaids made of water. The mermaids crash into a target, dousing them in water.[1]"}
{"spell_name": "Share the Same Fate", "spell_type": "Permeation Magic", "spell_description": "With an opengrimoire, the user covers a group of people, including the user, in Permeation Magic, which turns them invisible and intangible to magic.[1]"}
{"spell_name": "Invasion of Heat-Infused Ice", "spell_type": "Painting Magic", "spell_description": "With an opengrimoire, the user creates amagic circlefrom which pours ice that can be directed to cover a target, immobilizing it. The ice can also cover a large area or target and weaken the target by making it more brittle.[1]"}
{"spell_name": "Phantom Dragon Vouivre's Shout", "spell_type": "Painting Magic", "spell_description": "With an opengrimoire, the user manifests a paint brush and a palette and, with a swipe of the brush, creates a large creature with the head and torso of a woman, bat-like wings, two bird-like legs, and a long scaly tail. The user then points their brush and the creature releases a magical blast in that direction.[1]"}
{"spell_name": "Invisible Soldiers", "spell_type": "Permeation MagicCreation Magic", "spell_description": "With an opengrimoire, the user manifest multiple heavily armored knights who wield swords and shields. The knights are invisible but can be sensed and defeated by magic.[1]"}
{"spell_name": "Invisible Scout", "spell_type": "Permeation Magic", "spell_description": "With an opengrimoire, the user covers themselves in Permeation Magic, which turns them invisible and intangible to magic.[2]While the user'smanais hidden, theirkican still be sensed.[3]"}
{"spell_name": "Detection Decoder", "spell_type": "Permeation Magic", "spell_description": "With an opengrimoire, the user creates a field of magic that swirls around and reveals any objects that are magically hidden.[1]"}
{"spell_name": "God's Game", "spell_type": "Painting Magic", "spell_description": "With an opengrimoire, the user manifests a paint brush and a palette and, with a swipe of the brush, creates a large bearded figure. Any spell fired at the user bends around the figure and is sent back at the attacker.[1]"}
{"spell_name": "Deux Tempêtes of Fire and Ice", "spell_type": "Painting Magic", "spell_description": "With an opengrimoire, the user manifests a paint brush and a palette and, with a swipe of the brush, creates two twisters, one of fire and one of water, to counter ice and fire spells, respectively.[1]"}
{"spell_name": "Invisible Traveling Companion", "spell_type": "Permeation Magic", "spell_description": "With an opengrimoire, the user covers a partner in Permeation Magic, which turns them invisible and intangible to magic.[1]"}
{"spell_name": "Conjunction", "spell_type": "Star Magic", "spell_description": "With an opengrimoire, the user holds up two fingers and gestures a circle. They then teleport to a spot beneath one of their stars. This can be used to escapeSpatial Magic.[1]"}
{"spell_name": "Spirit Dive", "spell_type": "Spirit Magic", "spell_description": "With an opengrimoire, the user assimilates an elemental spirit into their body. The spell enables the user to contain and control the power of the spirit, dramatically increasing their own magic power.[1]"}
{"spell_name": "Stone Model of the World", "spell_type": "Stone MagicCreation Magic", "spell_description": "With an opengrimoire, the user manifests a stone formation of a location that the user would like to observe. The model consists of a meticulous representation of the desired location, including the changes that are happening to the original location due to various means. The user could easily create a model of an entire city with the use of this spell.[1]"}
{"spell_name": "Salamander's Claw", "spell_type": "Fire MagicSpirit Magic", "spell_description": "With an open grimoire, the user summonsSalamander, which covers its claws in fire and, with a swipe of its leg, releases five large slashes that are capable of burning and slicing through several trees.[1]"}
{"spell_name": "Dimension Slash Scorching Light", "spell_type": "Compound MagicDark MagicMercury MagicFire MagicSpirit Magic", "spell_description": "TheMercury Magicuser extends the length of theDark Magicuser's blade, and theFire Magicuser ignites the extended blade with flames fromSalamander. The Dark Magic user then cuts down their opponent with their enhanced magic blade.[1]"}
{"spell_name": "Solid Rock", "spell_type": "Stone Magic", "spell_description": "With an opengrimoire, the user cobbles together a large boulder which floats above their hand. The boulder can then be thrown at a target.[1]"}
{"spell_name": "Pursuing Crushed Rock", "spell_type": "Stone MagicCreation Magic", "spell_description": "With an opengrimoire, the user generates a giant stone boulder and then launches the boulder at a target. Due to its size and sturdiness, the boulder can also act as a defense against opponents' spells.[1]"}
{"spell_name": "Quartile Flagellum", "spell_type": "Star Magic", "spell_description": "With an opengrimoire, the user extends a line of starlight from their hand and connects four stars. The user then swings the line like a whip. The whip is so thin and sharp that it easily cuts through people and walls.[1]"}
{"spell_name": "Silver Feather Shower", "spell_type": "Steel Magic", "spell_description": "With an opengrimoireand while wearing winged armor, the user spreads the armor's wings and fires a swarm of steel feathers from them. The feathers arc out and can home in on the target, striking at them from multiple angles.[1]"}
{"spell_name": "Salamander's Breath", "spell_type": "Fire MagicSpirit Magic", "spell_description": "With an opengrimoire, the user summonsSalamander, the fire spirit, and then launches an enormous blaze of fire from the spirit's mouth. The continuous stream of fire could be used to pin down targets and to ignite large areas.[1][2][3]"}
{"spell_name": "Sea Dragon's Roar", "spell_type": "Water MagicCreation Magic", "spell_description": "With an opengrimoire, the user points their arm at a target, manifests the head of a sea dragon with sharp teeth, and fires it at the target.[1]The user could change the spell's direction mid-flight should it miss.[2]"}
{"spell_name": "Sea Dragon's Nest", "spell_type": "Water MagicCreation Magic", "spell_description": "With an opengrimoire, the user crouches, places both hands near the ground, and then manifests a dome composed of multiple whirlpools, which covers the user's surroundings.[1]The user is capable of freely controlling the size and position of the dome.[2]When created in mid-air, the spell forms a sphere.[3]"}
{"spell_name": "Blazing Spiral Lance", "spell_type": "Steel Magic", "spell_description": "With an opengrimoire, the user creates a huge lance with a spiral head. The lance rotates at a high speed and, with a thrust, can easily drill through thick blocks of stone.[1]"}
{"spell_name": "Steel Castle's Armored Wall", "spell_type": "Steel MagicCreation Magic", "spell_description": "With an opengrimoire, the user crouches and touches the ground. A wall of steel instantly rises from the ground in front of them. The wall itself has intricate designs of a series of pillars and arches at one side.[1]"}
{"spell_name": "Sea Dragon God's Vortex", "spell_type": "Water Magic", "spell_description": "With an opengrimoireandValkyrie Dress, the user spins rapidly like a whirlpool, not only blocking incoming attacks but also repeatedly striking nearby enemies.[1]"}
{"spell_name": "Saint Valkyrie Dress", "spell_type": "Water MagicSpirit MagicCreation Magic", "spell_description": "With an opengrimoire, the user assimilatesUndineinto their body andarmor. The tiara becomes a small crown with a halo above it. The two large wing-like ornaments hanging off the lower back become feathered and more like wings. The lance's texture smooths out, and a rounded guard extends from the vamplate and connects to the base of the handle.[1]Additionally, the user is able to create a sword made of water as an additional melee weapon in battle.[2]"}
{"spell_name": "Sea Dragon God's Tail", "spell_type": "Water Magic", "spell_description": "With an opengrimoireandValkyrie Dress, the user shapes a dragon-like tail out of water and swings it into an opponent, smacking them down.[1]"}
{"spell_name": "Le Château de Verre", "spell_type": "Union MagicSteel MagicGlass Magic", "spell_description": "TheSteel Magicuser creates a large steel structure, consisting of a multi-panel wall, a set of tank treads, and a several spinning, conical drills. TheGlass Magicuser covers the upper portion of the wall with glass flowers and creates several large glass flowers that float around the structure.[1]The spell's destructive capabilities are unknown."}
{"spell_name": "Sea Dragon's Waterball", "spell_type": "Water Magic", "spell_description": "The user creates a large swirling sphere of water at the end of their hand or wand or between their hands, and then launches the sphere at their target.[1]The force behind the spell can form craters in the ground and propel people through the air.[2][3]"}
{"spell_name": "Qualle Operation", "spell_type": "Water MagicHealing Magic", "spell_description": "With an opengrimoire, the user creates a swarm of jellyfish made of water. Their tentacles wrap around the wound, and the user is able to analyze it.[1]"}
{"spell_name": "Sea God's Hammer", "spell_type": "Water MagicCreation Magic", "spell_description": "With an opengrimoire, the user manifests an enormous forearm wielding an equally-large hammer that levitates above the user.[1]The user then swings the hammer, either horizontally or vertically, by swinging their arm the same way.[2]"}
{"spell_name": "Mirrors Meteor Dragon", "spell_type": "Union MagicMirror MagicWater MagicCreation Magic", "spell_description": "While wearingValkyrie Dress, theWater Magicuser is multiplied withMirrors Brigade. The original and their copies then fire offSea Dragon's Roarsfrom multiple directions.[1]"}
{"spell_name": "Point-Blank Sea Dragon's Roar", "spell_type": "Water MagicCreation Magic", "spell_description": "After piercing an opponent with alance, the user creates alarge dragon head, with the user in the dragon's throat. The dragon's mouth then slams shut on the opponent. This spell's full potential is unknown as it was destroyed before dealing any damage.[1]"}
{"spell_name": "Holy Fist of Love", "spell_type": "Water MagicCreation Magic", "spell_description": "With an opengrimoire, the user swings downward with a fist and creates an enlarged version of the fist composed entirely of water.[1]"}
{"spell_name": "Sea Dragon's Cradle", "spell_type": "Water MagicCreation Magic", "spell_description": "With an opengrimoire, the user manifests an enormous, smooth sphere of whirling water with a ring of watery globs.[1]"}
{"spell_name": "Sachiel's Flash", "spell_type": "Union MagicWater MagicSpatial Magic", "spell_description": "With an opengrimoireand purifieddevilpower, the user opens a small spatial portal from which shoots a continuous beam of high-pressure water. The beam is capable of cutting through buildings, and the user is capable of altering the direction of the portal to change the beam's angle and follow the target's movement,[1]as well as create multiple portals at once for additional beams.[2]"}
{"spell_name": "Climbing Coelacanth", "spell_type": "Water MagicCreation Magic", "spell_description": "The user points their hand towards a target and manifests from a pool of water the head of acoelacanthwith sharp teeth. Its body is a stream of water allowing it to launch itself long distances.[1]"}
{"spell_name": "Cascade Destroyer", "spell_type": "Water MagicCreation Magic", "spell_description": "With an opengrimoire, the user holds their hand up and manifests five balls of water above their head. These balls can then release pressurized streams of water toward a target.[1]"}
{"spell_name": "Aquenelle Lore", "spell_type": "Water MagicHealing Magic", "spell_description": "With an opengrimoire, the user creates a large bubble of water that encapsulate the target. Small fish swim around in the bubble while the target's injuries are treated."}
{"spell_name": "Aqua Curtain", "spell_type": "Water Magic", "spell_description": "With an opengrimoire, the user covers themselves with a large amount of water. This spell can be used to put out fire that has covered the user.[1]"}
{"spell_name": "Aqua Javelin", "spell_type": "Water Magic", "spell_description": "With an opengrimoire, the user creates a javelin made of water that can be thrown at a target. The javelin also has a ribbon made of water, attached to it.[1]"}
{"spell_name": "Death Dealing Sea Serpent", "spell_type": "Water MagicCreation Magic", "spell_description": "With an opengrimoire, the user releases a serpent-shaped stream of water that is ready to attack the user's targets.[1]"}
{"spell_name": "Holy Water Assassination Bullet", "spell_type": "Water MagicCreation Magic", "spell_description": "With an opengrimoire, the user gathers streams of water together to create a large bullet. The user could launch the bullet towards a target.[1]"}
{"spell_name": "Demon-Dweller Sword: Protecting Light", "spell_type": "Union MagicSword MagicLight Magic", "spell_description": "Using theDemon-Dweller Sword's ability to connect to their allies, the two mages grab hold of the sword, and theSword Magicuser channels theLight Magicuser's power through the sword to their allies. The Light Magic creates a large protective aura[1]that also boosts the recipients' speed.[2]"}
{"spell_name": "Demon-Dweller Sword", "spell_type": "Sword MagicAnti Magic", "spell_description": "The sword is summoned out of an openedgrimoire, inside which it is stored in the form of writing.[4]The user can easily summon the sword at will without consuming any magical power.[5]"}
{"spell_name": "Ludic Sanctuary", "spell_type": "Water MagicSpirit Magic", "spell_description": "The user summons a pillar of swirling water around a target, lifting them high into the air. The user thenpulls in water from their surroundings, combines it withUndineand the pillar, and creates a massive body of water. Largenatural mana arraysare placed above, below, and around the body of water."}
{"spell_name": "Demon-Slayer Sword", "spell_type": "Sword MagicAnti Magic", "spell_description": "The sword is summoned out of an opened grimoire, inside which it is stored in the form of writing. The user can easily summon the sword at will without consuming any magical power.[3][4]"}
{"spell_name": "Current of the Fortune River", "spell_type": "Water Magic", "spell_description": "With an opengrimoire, the user creates a stream of water that moves towards the user's desired direction, creating a course. Subsequently, the stream of water carries the user through the course it has created without the need of the user to actively control the water's movements.[1]"}
{"spell_name": "Demon-Destroyer Sword", "spell_type": "Sword MagicAnti Magic", "spell_description": "The sword is summoned out of an openedgrimoire, inside which it is stored in the form of writing. The user can easily summon the sword at will without consuming any magical power.[4]"}
{"spell_name": "Lightning Battle Fiend", "spell_type": "Lightning MagicUltimate Magic", "spell_description": "Afterborrowing a large amount of natural mana,[1]Luck covers his whole body inLightning Magic, with thigh-high boots and clawed hands. He grows two horns from his head, two lightning-shaped protrusions from his shoulder blades, and a lightning-shaped tail from his lower back. His pupils become vertical slits, and two lightning bolt markings appear on his cheeks, resembling the tattoos fromLufulu's possession. Eight balls of lightning float in a circle behind his back."}
{"spell_name": "Flower Princess Utopia", "spell_type": "Plant MagicHealing MagicUltimate Magic", "spell_description": "With an opengrimoire, Mimosa garbs herself in a winged dress made of flowers and creates a large multi-layerednatural mana arrayunderneath her target. Flowers grow around the array, covering the floor, while a thick bundle of stems grow from the center of the array and forming a tower with a cradle of flowers at the top."}
{"spell_name": "Apocalypra Astrauza", "spell_type": "Lightning MagicUltimate Magic", "spell_description": "With an opengrimoire, Gadjah forms several interconnectednatural mana arraysaround his right hand. The arrays concentrate a large amount of mana and convert his lifeforce into more magic. As he thrusts his right hand forward, the arrays release all the magic in a concentrated beam of lightning that is capable of overpoweringDecaying Worldand disintegrating the body of a highest-rankingdevil(but not completely).[1]"}
{"spell_name": "Exercitus Leonum", "spell_type": "Fire MagicUltimate Magic", "spell_description": "With an opengrimoireand after prolonged usage ofHellfire Incarnate, Mereoleona fully transforms her body intomanaand then resurrects her allies, transforming their bodies into mana as well. These resurrected allies retain their personalities and memories and can act independently of Mereoleona. In their new forms, Mereoleona and her allies have increased strength and can recreate their individual spells out of fire.[1]"}
{"spell_name": "Black Lightning Battle Fiend", "spell_type": "Lightning MagicUltimate MagicAnti Magic", "spell_description": "As with the spell'sregular version, Luckdraws upon ambient manato cloak his body inlightning, thus acquiring horns, thigh-high boots, clawed hands, lightning-shaped shoulder protrusions, a tail, and a circular, floating array of electric orbs behind his back; however, the lightning adopts a black coloration due to theAnti Magic's influence. Not only can Luck dart around at lightning speeds while performing powerful melee attacks and ricocheting off his ownrune arrays, but also the Anti Magic covering him renders him resistant to and capable of neutralizing enemymagic. In this form, Luck quickly and easily destroyed severalGuardian Angels.[1]"}
{"spell_name": "Demon-Dweller Sword: Conquering Eon", "spell_type": "Sword MagicUltimate Magic", "spell_description": "Licht holds theDemon-Dweller Swordaloft and has it absorb the magic of his allies. He then swings the sword down and unleashes the collected power in a single slash."}
{"spell_name": "Mémoire Absolue", "spell_type": "Memory MagicCommunication Magic", "spell_description": "With an opengrimoire, the user creates a spiked dome over the target's head. The dome connects to a sphere further above the target, and along the connecting column are five horizontal planes.[2]"}
{"spell_name": "Origin Flash", "spell_type": "Sword Magic", "spell_description": "With an opengrimoire, the user summons a sword to their hand and, swinging it, releases a giant slash that cuts anything in its path. Afterwards, the sword dissipates."}
{"spell_name": "Million Laser", "spell_type": "", "spell_description": "With an opengrimoire, the user releases their collected mana, forming a sphere around themselves, and fires off countless beams that can destroy an area.[1]"}
{"spell_name": "Mud Man", "spell_type": "Mud Magic", "spell_description": "The user creates a small figure composed of mud. The figure is able to perform simple tasks.[1]"}
{"spell_name": "Mosquito Noise", "spell_type": "Mosquito Magic", "spell_description": "With an opengrimoire, the user generates several large metallic needles and scatters them around an area. The needles produce a high-pitched squeal that debilitates the target."}
{"spell_name": "Monster Toy", "spell_type": "Game Magic", "spell_description": "The user manifests a large monstrous fish to attack a target.[1]Multiple fish could be created simultaneously.[2]"}
{"spell_name": "Magic Convert", "spell_type": "Transmutation Magic", "spell_description": "With an opengrimoire, the user releases a cloud of magic that transmutes any magic into a different element of their choosing.[2][3]"}
{"spell_name": "Magic Bullet", "spell_type": "", "spell_description": "The user manifests and concentrates their mana on their hand. Subsequently, the user can launch the mana towards an opponent, blasting them away.[3]"}
{"spell_name": "Mana-Sucker", "spell_type": "Mosquito Magic", "spell_description": "With an opengrimoire, the user extends large metallic needles from their palms. These needles drain themanafrom anyone they scratch or pierce."}
{"spell_name": "Iron God of War", "spell_type": "Iron Magic", "spell_description": "The user transforms their body into iron, including their clothes. Armor-like ridges and protrusions also form from their skin and clothes: a crest and forehead plate from their forehead and eyebrow ridge, a circle of three magatama on the sternum, shoulder and forearm guards."}
{"spell_name": "Ideal Closer", "spell_type": "Corundum Magic", "spell_description": "With an opengrimoire, the user's body is completely covered by corundum with only a Y-shaped opening for their eyes and mouth. The armor takes a larger humanoid shape, complete with arms and legs. The user is able to control the armor and use the limbs to attack a target.[1]"}
{"spell_name": "Hydra of Darkneros", "spell_type": "Demon Water Magic", "spell_description": "The user generates a large sphere of water around themselves and then extends multiple large serpents from the surface of the sphere. These eyeless, spiked serpents try to crush their target in their sharp-toothed mouths.[1]"}
{"spell_name": "Huge Sticky Salamander", "spell_type": "Gel Magic", "spell_description": "With an opengrimoire, the user increases the size of aSticky Salamanderto be several stories tall. This spell requires an enormous amount ofmana.[1]"}
{"spell_name": "Gambler's Fallacy", "spell_type": "Dice Magic", "spell_description": "With an opengrimoire, the user casts a die and generates a magical blast based on the number of pips shown, with one being the weakest and six being the strongest.[1]"}
{"spell_name": "Glutton's Banquet", "spell_type": "Food Magic", "spell_description": "With an opengrimoire, the user manifests a giant wolf with a fork and knife. The wolf uses the utensils to stab and drag spells into its mouth. The consumed magic is then converted into energy for the user.[1]"}
{"spell_name": "Death Thrust", "spell_type": "Dark Magic", "spell_description": "WithBlack Moonactive, the user holds up their sword, draws it back, and super condenses the spell's effect into a small area around their arm. The user then thrusts their sword toward their target; the thrust creates a focused blast that can destroy a person's torso.[1]"}
{"spell_name": "Gehenna Game", "spell_type": "Legion Magic", "spell_description": "With an opengrimoire, the user creates a handheld circular chessboard and pieces. Subsequently, the user can summon the pieces off of the board and transform them into larger versions with which to attack enemies. As soldiers are destroyed, new ones can be created and sent out.[1]"}
{"spell_name": "Glamour World", "spell_type": "Dream Magic", "spell_description": "With an opengrimoire, the user releases a multi-hued mist that pulls anything it touches into a World of Dreams 「夢の世界Yume no Sekai」. The mist affects people and inanimate objects, like buildings.[1]Those trapped inside grow drowsier as time passes and will die if they fall asleep.[2]"}
{"spell_name": "World End Church", "spell_type": "Ice Wedge Magic", "spell_description": "With an openedgrimoire, the usertakes controlof the surrounding mana and generates a gigantic church made out of ice, causing the nearby temperature to drop to absolute zero. This spell is capable of freezing even lava and a portion of theUltime-Volcano Mountain Trail."}
{"spell_name": "Queen of Briars", "spell_type": "True Briar Magic", "spell_description": "The user creates anatural mana arraythat generates real roses, and then wraps themselves in a dress and crown made of briars, with blue roses on the right side and red roses on the left side. The user also creates a briar whip which can strike opponents with vines of red roses or wrap an opponent in blue roses. The stronger a victim is, the tighter the blue rose vines are.[1]"}
{"spell_name": "Silver Star of Execution", "spell_type": "Mercury MagicCreation Magic", "spell_description": "With an opengrimoire, the user spreads strands and drops of mercury throughout an area. The mercury is then gathered together and shaped into a giant cage. Like other Mercury Magic spells, the bars can fluidly switch between offense and defense: forming and launchingSilver Spearsat the target or blocking escape and counterattacks with silver shields.[1]"}
{"spell_name": "Lamp of Avior Gloria", "spell_type": "Light Magic", "spell_description": "Aftertaking controlof the surroundingmana, the user unleashes multipleconcentrated blasts of light.[1]"}
{"spell_name": "Silver Spear", "spell_type": "Mercury Magic", "spell_description": "With an opengrimoire, the user generates a spear made of mercury and then launches the spear at a target.[1]Multiple spears could be generated and fired together.[2]The spear can be melted by extremely hotfire.[3]"}
{"spell_name": "Blue Rose Paradise", "spell_type": "Briar Magic", "spell_description": "The user creates two connected, concentricmagic circlesin soil and water on the floor. The arrays generate briars that cover the floor, extend up the walls, and capture any enemies touching the vines. If the victims arecursed, the vines will grow stronger from absorbing and weakening the curse power.[1]"}
{"spell_name": "Endless Domination", "spell_type": "Legion Magic", "spell_description": "With an opengrimoire, the user creates a giant circular chessboard and pieces. Subsequently, the user can summon a considerable number of the  pieces off of the board and transform them into larger versions with which to attack enemies. As soldiers are destroyed, new ones can be created and sent out.[1]"}
{"spell_name": "End Empress", "spell_type": "Legion Magic", "spell_description": "With an opengrimoire, the user combines countless magic soldiers into one gigantic soldier and then places themselves into the soldier, controlling it like a giant suit of armor.[1]"}
{"spell_name": "Jötunn's Ice Floe", "spell_type": "Ice Magic", "spell_description": "With an opengrimoire, the user creates a massive chunk of ice and drops it onto an opponent, crushing them under the weight.[1]"}
{"spell_name": "Blink Castling", "spell_type": "Legion Magic", "spell_description": "With an opengrimoire, the user instantly switches places with one of their magic soldiers, enabling the user to dodge attacks and to place themselves in a more advantageous position."}
{"spell_name": "Profound Spiral Flames", "spell_type": "Fire Magic", "spell_description": "The user creates anatural mana arraythat generates a larger, more powerfulSpiral Flamethat can extend over great distances.[1]The user could also create multiple circles to attack multiple targets simultaneously.[2]"}
{"spell_name": "Crimson Eruption", "spell_type": "True Fire Magic", "spell_description": "The user creates anatural mana arraythat encompasses a large area. The array emits a huge gout of flame that engulfs everything within the magic circle."}
{"spell_name": "Gravity Singularity", "spell_type": "Gravity Magic", "spell_description": "With an opengrimoire, the user creates a small black hole that sucks in and destroys anything in a short range around it. The user can control the singularity's movement and launch it at an opponent. As the singularity moves away from the user, it grows larger and the range of its destruction expands. The singularity can carve through mountains in seconds.[1]"}
{"spell_name": "Evil God's Pressure Craft", "spell_type": "Gravity Magic", "spell_description": "With an opengrimoire, the user pulls a large rock up out of the ground and then uses immense gravitational pressure to compress the rock into the shape of a large sword."}
{"spell_name": "Phoenix Feathers Robe", "spell_type": "Fire MagicHealing Magic", "spell_description": "With an opengrimoire, the user envelops their body in flames which flair out like a pair of wings. As the flames burn, the user's body is healed and stamina is rejuvenated.[1]The spell could be cast onto another person[2][3]or shared by two people.[4]"}
{"spell_name": "Presence of the Demon King", "spell_type": "Gravity Magic", "spell_description": "With an opengrimoire, the user dramatically increases the strength of gravity in an area in front of them. Any objects in the area are slammed into the ground. It is capable of stopping a large projectile, bending magical light, and snapping trees in half,[1]but cannot affectAnti Magic attacks.[2]"}
{"spell_name": "Verre Fleur", "spell_type": "Glass MagicCreation Magic", "spell_description": "Upon activating the spell, the user throws his hands up in the air and a series of sharp glass spikes rises from the ground. These spikes are of similar blade-like shapes but appear in different sizes as they form together into the shape of a flower.[1]"}
{"spell_name": "Curse-Breaking Blood Cocoon", "spell_type": "Blood MagicHealing Magic", "spell_description": "With an opengrimoire, the user points their finger at a target. Veins of blood extend from the finger, envelope the target in a large dark orb, and surround the wounded part of the target, healing it.[1]"}
{"spell_name": "Icicle Bridge", "spell_type": "Ice Magic", "spell_description": "With an opengrimoire, the user creates a large chunk of jagged ice. Once released, the ice extends towards a target.[1]"}
{"spell_name": "Heavy Infighting", "spell_type": "Gravity Magic", "spell_description": "With an opengrimoire, the user moves in close to their opponent and rapidly punches them. The user augments gravity in a way that it simultaneously increases the weight of their fists, making the punches deal more damage while decreasing the weight of it, making the punches faster.[1]"}
{"spell_name": "Soothing Holy Light", "spell_type": "Fire MagicHealing Magic", "spell_description": "With an opengrimoire, the user manifests several lit candles that softly glow and float around the target. Steam emanates from the wounds as they heal.[1]The spell could be applied to a large group.[2]"}
{"spell_name": "Heavy Infighting Gladiator", "spell_type": "Gravity Magic", "spell_description": "With an opengrimoire, the usercrafts a sword from compressed rock, moves in close to their opponents, and swings the sword rapidly. By decreasing the gravity acting on the user's arm and sword, it greatly increases the speed of the swings.[1]"}
{"spell_name": "Verre Epée", "spell_type": "Glass MagicCreation Magic", "spell_description": "With an opengrimoire, the user throws their hands up in the air and several glass swords erupt from the ground. The swords are sharp and durable enough to damage crystal.[1]"}
{"spell_name": "Ice Slicer", "spell_type": "Ice Magic", "spell_description": "With an opengrimoire, the user extends their arm towards a target and creates spikes made of ice. The spikes shoot out of surfaces around and in the direction of the target.[1]"}
{"spell_name": "Talking Mr. Mushroom", "spell_type": "Fungus Magic", "spell_description": "The user creates anamanita mushroomthrough which they are capable of communicating. The mushroom has a serious face with eyebrows, eyes, nose, mouth, and chin.[1]If damaged, the mushroom will crumble away.[2]"}
{"spell_name": "Ice Needle", "spell_type": "Ice Magic", "spell_description": "With an opengrimoire, the user creates a series of giant spikes made of ice that thrust up from the ground and pierce the target.[1]"}
{"spell_name": "Ice Funeral", "spell_type": "Ice Magic", "spell_description": "Using a magic tool placed inside their body, the user completely encases themselves in ice. The countless icicles protruding outwards prevent outside interference.[1]"}
{"spell_name": "Crystal Ice Shield", "spell_type": "Ice Magic", "spell_description": "With an opengrimoire, the user raises their arm forward and manifest barriers in the form of snowflakes with various shapes and sizes. These barriers are strong enough to withstand incoming attacks, including attacks of a polar element such as fire.[1]"}
{"spell_name": "Running Mr. Mushroom", "spell_type": "Fungus Magic", "spell_description": "With an opengrimoire, the user creates a large Russula Albonigra mushroom on which they can ride. The mushroom has arms, legs, and a smiling face.[1]"}
{"spell_name": "Bubble Refresher", "spell_type": "Bubble MagicHealing Magic", "spell_description": "With an opengrimoire, the user creates a large seashell filled with countless bubbles under the target."}
{"spell_name": "Silver Rain", "spell_type": "Mercury Magic", "spell_description": "With an opengrimoire, the user summons countless droplets of mercury down from the sky. Due to the high density of mercury and the momentum it gathers as it falls from the sky, each droplets has enough force to break through anything on its path.[1]"}
{"spell_name": "Towering Mr. Mushroom", "spell_type": "Fungus Magic", "spell_description": "With an opengrimoire, the user grows a giant Pleurotus eryngii mushroom, which has arms, legs, and a face.[1]"}
{"spell_name": "Verre Détection", "spell_type": "Glass Magic", "spell_description": "With an opengrimoire, the user creates several panes of glass and spreads them around an area. Using reflected light between the panes, the user is able to search in multiple directions and over a wide area.[1]"}
{"spell_name": "Heavenly Ice Fang", "spell_type": "Ice Magic", "spell_description": "With an opengrimoire, the user swings their arms towards their target and a large icicle appears from the ground and strikes the target."}
{"spell_name": "Silver Guardian", "spell_type": "Mercury Magic", "spell_description": "With an opengrimoire, the user concentrates their mercury into a defensive coating over their entire body.[1]The mercury is solid enough to block repeated strikes and to crack when broken but is still flexible enough not to hinder the user's movements.[2]"}
{"spell_name": "Silver Bullet", "spell_type": "Mercury Magic", "spell_description": "With an opengrimoire, the user condenses mercury into small spheres and launches them at a target.[1]"}
{"spell_name": "Janus Baptism", "spell_type": "Key Magic", "spell_description": "With an opengrimoire, the user summons a key, which then attaches itself into the target's grimoire, stealing the target's magic, including their spells and draining theirmana. During this duration, the stolen targets are prevented from using their spells. The stolen magic can then be channeled throughJanus Abigail. The weaker the target, the easier it is to steal their magic."}
{"spell_name": "Light Shaft of Divine Punishment", "spell_type": "Light Magic", "spell_description": "With an opengrimoire, the user concentrates light between their hands until it builds into a large sphere. The light is released in a column of light too fast and widespread to avoid.[1][2]"}
{"spell_name": "Light Sword of Judgment", "spell_type": "Light Magic", "spell_description": "With an opengrimoire, the user creates multiple shards of light, with four lines going through each shard, that can be thrown at a target.[2]"}
{"spell_name": "Janus Abigail", "spell_type": "Key Magic", "spell_description": "With an opened grimoire, the user opens up a magical space capable of storing objects and stolen magic fromJanus Baptismwithin. The user can freely open the magical space through doors which have their own respective keys. The user can also freely use whatever stolen magic and spells are stored within the respective magical space."}
{"spell_name": "Heaven-Splitting Flash", "spell_type": "Light Magic", "spell_description": "With an opengrimoire, the user creates multiple orbs of light and fires beams of light from them.[2]"}
{"spell_name": "Doom's Gate", "spell_type": "Key Magic", "spell_description": "With an opengrimoire, the user sacrifices all of their remaining life span and consumes all of themagic storedby their Key Magic, then fuses it into a single gargantuan attack which will then be unleashed on the summoned door. This spell is strong enough to threaten the entirety of theClover Kingdom.[1]"}
{"spell_name": "Silver Shining Regal Spear", "spell_type": "Mercury Magic", "spell_description": "With an opengrimoire, the user holds out the palm and extends from it a long beam made of shining mercury. The beam follows the movement of the user's palm. It is sharp enough to pierce and slice through several feet of rock.[1]"}
{"spell_name": "Bright Judgment Whip", "spell_type": "Light MagicCreation Magic", "spell_description": "With an opengrimoire, the user manifests a long whip of light, which extends from the user's hand and has unpredictable movements when swung. It has enough power and speed to destroy a cave in seconds.[1]"}
{"spell_name": "Thunderclap Crumbling Orb", "spell_type": "Lightning Magic", "spell_description": "With an opengrimoireandThunder God's Gloves, the user focuses their Lightning Magic to the tip of their fingers to create a concentrated orb of lightning, which is then launched towards the target.[1]"}
{"spell_name": "Silver Blade", "spell_type": "Mercury Magic", "spell_description": "With an opengrimoire, the user creates a double-edged sword out of mercury. The sword floats in the air and can move without direct contact from the user."}
{"spell_name": "Absolute Monarch of Divine Brilliance", "spell_type": "Light Magic", "spell_description": "With an opengrimoire, the user emits light from their body and projects a giant image of themselves. This spell is noted as being slow for Light Magic.[1]"}
{"spell_name": "Lamp of Avior", "spell_type": "Light Magic", "spell_description": "With an opengrimoire, the user surrounds themselves with light and then, holding out their arm, launches the concentrated light at a target."}
{"spell_name": "Arrows of Judgment", "spell_type": "Light Magic", "spell_description": "With an opengrimoire, the user releases their magic power in a sphere around themselves. As the sphere expands, it flattens out and is shaped into countless blades of light.[1]Once complete, the blades rain down on and automatically target those below.[2][3]"}
{"spell_name": "Thunder Fiend", "spell_type": "Lightning Magic", "spell_description": "With an opengrimoire, the user clads theirfeetandhandsand uses their increased speed to blitz a target, ricocheting around an area. The user's momentum also increases the strength of their strikes.[2][3]"}
{"spell_name": "Tenjiolia", "spell_type": "Lightning Magic", "spell_description": "With an opengrimoire, the user holds out their right hand and releases a lightning bolt from their palm. This spell is incredibly fast. The user could also layer additional commands onto the spell, allowing it to change direction and pursue a target.[1]"}
{"spell_name": "Healing Ray of Light", "spell_type": "Light MagicHealing Magic", "spell_description": "With an opengrimoire, the user emits light from a hand, and the beads of light surround the wound while it heals.[1]"}
{"spell_name": "Pulsaranta", "spell_type": "Lightning Magic", "spell_description": "With an opengrimoire, the user holds their hands on both sides of their target's head and then discharges electricity through the target's body, painlessly stunning them for a brief period of time.[1]"}
{"spell_name": "Thunderbird Cavalry: Sky-Splitting Magic Bow Armament", "spell_type": "Lightning MagicCreation Magic", "spell_description": "With an opengrimoire, the user extends their right arm to generate a large bow made of lightning, creating six large arrows that are fired at a target. These arrows are powerful enough to pierce through a barrier powered by fifty men.[1]"}
{"spell_name": "God of Lightning Rising Salim", "spell_type": "Lightning Magic", "spell_description": "With an opengrimoire, the user creates a large ball of lightning in front of themselves and, with a thrust of their hand, directs the ball toward the opponent.[1]This spell's destructive capabilities are unknown."}
{"spell_name": "Keraunos", "spell_type": "True Lightning Magic", "spell_description": "While clad withThunder God's BootsandGloves, the user creates five layers ofnatural mana arraysbeneath their feet. The arrays turn the user into a lightning bolt, propelling them toward the target at tremendous speed. The increased speed boosts the user's attack, enabling them to pierce through magically reinforced defenses.[1]"}
{"spell_name": "Irial Astrauza", "spell_type": "True Lightning Magic", "spell_description": "With an opengrimoire, the user holds their right hand up and draws amagic circlein the sky. Storm clouds gather around the magic circle as it focuses natural mana,[1]and a large lightning bolt crashes down on the target. Afterward, the clouds disperse.[2]"}
{"spell_name": "Thunder God's Gloves", "spell_type": "Lightning MagicCreation Magic", "spell_description": "With an opengrimoire, the user forms a pair of gloves out of lightning. These clawed gloves extend up to their elbows.[2]"}
{"spell_name": "Flame-Lightning Explosive Cannon", "spell_type": "Union MagicFire MagicLightning Magic", "spell_description": "The fire mage gathersFire Magicin their right hand while the lightning mage gathersLightning Magicin their left hand. The two mages then combine their magic into a single mass of magic and thrust their hands with the magic towards their target. The magical discharge creates a massive explosion.[1][2]"}
{"spell_name": "Thunder God's Boots", "spell_type": "Lightning MagicCreation Magic", "spell_description": "With an opengrimoire, the user forms a pair of boots out of lightning. Sparks of electricity can also be seen when the boots are in use. The boots' primary capability is enhancing the user's physical abilities, such as jumping power and speed.[1]The user is able to leap over long distance, and as momentum is built, they are also able to travel on the wall.[2]The boots are useful in hand-to-hand combat as they enhance the user's legs, enabling more powerful kicking moves.[3]"}
{"spell_name": "Black Flame Black Lightning Explosive Cannon", "spell_type": "Union MagicFire MagicLightning MagicAnti Magic", "spell_description": "This spell is anAnti Magicinfused version ofFlame-Lightning Explosive Cannon.[1]"}
{"spell_name": "Storm of Light Imperial Swords of Conviction", "spell_type": "Union MagicLight MagicMirror Magic", "spell_description": "TheLight Magicuser creates several largeswords of light, while theMirror Magicuser multiple giant mirrors around a target. The swords are launched at the target and the mirrors reflect the swords back so that they hit the target multiple times."}
{"spell_name": "Reflect Refrain", "spell_type": "Mirror Magic", "spell_description": "With an opengrimoire, the user manifests multiple mirrors that reflect light off of each other and destroy whatever is between them.[1]The spell does not have any effect onGel Magic.[2]"}
{"spell_name": "Nadaras do Astrauza", "spell_type": "True Lightning Magic", "spell_description": "With an opengrimoire, the user creates multiplenatural mana arraysat various angles in midair. The arrays generate lightning bolts that tear through targets. It is effective at clearing a path through multiple opponents.[1]"}
{"spell_name": "Mirrors Shift", "spell_type": "Mirror Magic", "spell_description": "With an opengrimoire, the user summons a mirror in a desired location and then appears instantaneously in front of said mirror, allowing the user to dodge attacks or place themselves in a more advantageous position.[1][2]"}
{"spell_name": "Diamond Yasha Princess ☆ Fivefold Dance", "spell_type": "Lightning Magic", "spell_description": "With an openscroll, the user manifests a pair ofkunaimade of lightning and holds them in a reverse grip. Lightning also streams from the user's hair. The user then dashes at their opponent in a zig-zag formation, spinning and slashing at the opponent. When boosted byZetten, the slashes are capable of piercing through the scales of a monstrously large dragon.[1]"}
{"spell_name": "Mirrors Brigade", "spell_type": "Mirror Magic", "spell_description": "With an opengrimoire, the user has their intended target look into the mirror stored in their eye and manifests multiple copies of the target that are capable of using the original's attacks and spells, even the power ofAnti Magic.[1][2]"}
{"spell_name": "Reflect Ray", "spell_type": "Mirror Magic", "spell_description": "With an opengrimoire, the user manifests a mirror as the tool to launch the attack. The user then could launch countless rays of attacks, through the mirror, toward their target.[1]"}
{"spell_name": "Reflect Iris", "spell_type": "Union MagicMirror MagicEye Magic", "spell_description": "TheMirror Magicuser creates an array of mirrors that reflect the appearance of theEye Magicuser. Any targets that look into the mirrors are caught in an enchantment, physically paralyzing them and blocking their magic.[1]"}
{"spell_name": "Real Double", "spell_type": "Mirror Magic", "spell_description": "With an opengrimoire, the user manifests a mirror in front of them and then summons his reflection from the mirror world. The clone has inverted outer features because it is the mirrored version of the user.[1][2]"}
{"spell_name": "Large Reflect Refrain", "spell_type": "Mirror Magic", "spell_description": "With an opengrimoire, the user manifests an array of large mirrors that reflect magical light off of each other and destroy whatever is between them. Because of the enlarged mirrors, more magic is required.[1]"}
{"spell_name": "Mirrors Slash", "spell_type": "Union MagicAnti MagicMirror Magic", "spell_description": "After the user has been multiplied withMirrors Brigade, theDemon-Dweller Swordsabsorb an ally's magic and, with a swing, release the magic in a flurry of flying slashes, which can nullify magic.[1]"}
{"spell_name": "Full Reflection", "spell_type": "Mirror Magic", "spell_description": "With an opengrimoire, the user manifests a mirror as a tool. The user then jumps in front of an incoming spell and enlarges the mirror to the size of the incoming spell. The incoming spell is then reflected back towards the caster.[1]"}
{"spell_name": "Dark Cloaked Iai Slash", "spell_type": "Dark Magic", "spell_description": "With an opengrimoire, the user sheathes their sword, condenses the area ofBlack Moon's effect, and waits for their opponent to attack. Once the opponent is in range, the user coats their sword in darkness, quickly draws the blade, and dashes forward, slashing the opponent across the stomach.[1]"}
{"spell_name": "Mirrors Meteorite", "spell_type": "Union MagicAnti MagicMirror Magic", "spell_description": "While wielding theDemon-Slayer Sword, theAnti Magicusercoats themselves in Anti Magicand is then multiplied withMirrors Brigade. The original and their copies thencharge a targetfrom multiple directions.[1]"}
{"spell_name": "Dark Cloaked Dimension Slash: Equinox", "spell_type": "Dark Magic", "spell_description": "Aftertaking controlof the surroundingmana, the user performs aDark Cloaked Dimension Slash, greatly extending the range and reach of the slash.[1]"}
{"spell_name": "Calidus Brachium Barrage", "spell_type": "Fire Magic", "spell_description": "Aftertaking controlof the surroundingmana, the user pummels the target withfiery blastsfrom multiple directions. The continuous stream of attacks from every direction makes it difficult to escape from or to defend against this spell.[2]"}
{"spell_name": "Large Reflect Ray", "spell_type": "Mirror Magic", "spell_description": "With an opengrimoire, the user manifests a large mirror as the tool to launch a large ray of light, through the mirror, toward their target. Because of the enlarged mirror, more magic is required.[1]"}
{"spell_name": "Black Moon", "spell_type": "Dark Magic", "spell_description": "With an opengrimoire, the usertakes control of the surrounding manaand then creates aBlack Holeoverhead, expanding the range of its absorption over a defined area. The user is also able to discriminate what gets absorbed by the spell, such as erasing an opponent's spell while leaving an ally's spell unaffected.[1]"}
{"spell_name": "Solid Mist Clones", "spell_type": "Mist Magic", "spell_description": "With an opengrimoire, the user generates a clone, including any equipment, out of mist. Multiple clones could be generated.[1]"}
{"spell_name": "Double Reflect Refrain", "spell_type": "Mirror Magic", "spell_description": "With an opengrimoireand the user having already used the spellReal Double, the user manifests double the amount of mirrors thanReflect Refrain, where light is reflected off of each mirror and destroys whatever is between them.[1]"}
{"spell_name": "Sealing Spectral Hands", "spell_type": "Mist MagicCreation Magic", "spell_description": "With an opengrimoire, the user covers an area in a thick mist and then shapes the mist into multiple clawed hands that grab the target's arms, legs, and torso.[1]"}
{"spell_name": "Calidus Brachium Purgatory: Abyss", "spell_type": "Fire Magic", "spell_description": "Afterassimilating a large amount of Fire Magic into their bodyandtaking controlof the surroundingmana, the user unleashes astream of punchesthat pummels a target and engulfs them with flames.[1]"}
{"spell_name": "Bewildering Forest of Mist", "spell_type": "Mist Magic", "spell_description": "With an opengrimoire, the user envelopes an area in a large cloud of mist that is shaped like a forest, hiding those within from view.[1]"}
{"spell_name": "Calidus Brachium Purgatory", "spell_type": "Fire Magic", "spell_description": "Aftertaking controlof the surroundingmana, the user pours all of their strength into astream of punchesthat engulfs the entire area with blue flames. The fire is strong enough to incinerate blocks of stone.[1]"}
{"spell_name": "Lunatic Crisis", "spell_type": "Moonlight Magic", "spell_description": "The user gathers mana around the Red Moon[1]then unleashes it as an enormous ray of magical moonlight.[2]"}
{"spell_name": "Crescent Cut Full Moon", "spell_type": "Moonlight Magic", "spell_description": "With an opengrimoire, the user creates aFull Moon Shelland then erratically fires multipleCrescent Cutsfrom the shield.[1]"}
{"spell_name": "Bewitching Moonlight", "spell_type": "Moonlight Magic", "spell_description": "With an opengrimoire, the user summons a large circle under a target. As moonlight shines up from the circle, the user tries to suppress the target'smanaand will in order to take control of their body.[1]If successful, dark veins appear at the corners of the target's eyes."}
{"spell_name": "Transient Illusion", "spell_type": "Mist Magic", "spell_description": "With an opengrimoire, the user envelopes an area in a large cloud of mist that obscures vision.[1]"}
{"spell_name": "Cage of Infinite Hail", "spell_type": "Compound MagicIce MagicMist Magic", "spell_description": "The spell is activated when two users are able to cast an ice and mist magic spell concurrently. Usually two or more mages are required to activate this spell where each of them would use one of the two required spells and combined them afterwards. Upon combining an ice spell and a mist spell, countless icicle would formed and the users could direct them towards their target.[1]"}
{"spell_name": "Illusion Vortex", "spell_type": "Mist Magic", "spell_description": "With an opengrimoire, the user raises their hands towards the target and generates a veil of mist that envelops the target. Using the mist, the users can cast an illusion on the target and make them wander within the mist for as long as the user desires.[1]"}
{"spell_name": "Full Moon Shell", "spell_type": "Moonlight Magic", "spell_description": "With an opengrimoire, the user holds out a staff and creates a dark translucent sphere around their whole body. This sphere acts as a defensive barrier and knocks back attacks and attackers.[1][2]"}
{"spell_name": "Eternal Fangs", "spell_type": "Bone Magic", "spell_description": "With an opengrimoire, the user protrudes countless bones out of their body. These bones are sharp and strong enough to pierce through dense sand and still puncture the target.[1]"}
{"spell_name": "Crescent Cut", "spell_type": "Moonlight Magic", "spell_description": "With an opengrimoire, the user holds out a hand or staff, concentrates moonlight at the end, and then launches the moonlight in a crescent-shaped blade. Multiple blades could be launched simultaneously.[1][2]"}
{"spell_name": "Fighters' Battle Song", "spell_type": "Sound Magic", "spell_description": "While playing their biwa, the user manipulates the sound and uses it to bolster their allies' bodies and reinvigorate their fighting spirits. It can also be used to communicate orders over long distances.[1]"}
{"spell_name": "Death Scythe", "spell_type": "Slash Magic", "spell_description": "Using the blades that the user created on their forearms with theirmana, the user creates a powerful slash that is capable of dividing the ground.[1]"}
{"spell_name": "Death Scythe: Lunatic Slash", "spell_type": "Slash Magic", "spell_description": "Using the blades that the user created on their forearms with theirmana, the user unleashes a chaotic flurry of flying slashes.[1]"}
{"spell_name": "Feather Tornado", "spell_type": "Feather Magic", "spell_description": "With an opengrimoire, the user creates a tornado from swirling feathers and directs it where to move by pointing their finger. Anyone caught within the tornado is struck repeatedly by the magical feathers.[1]"}
{"spell_name": "Dagger-Folding Early Summer Rain", "spell_type": "Paper Magic", "spell_description": "With an opengrimoire, the user generates multiple pieces of paper folded into blades. These blades are sharp enough to pierce stone but will be torn apart if struck on the flat sides.[1]"}
{"spell_name": "Maximum Exploding Fireball", "spell_type": "Fire Magic", "spell_description": "With an opengrimoire, the user generates a largeExploding Fireballin the palm of their hand and slams it into an opponent. The fireball's explosion generates extensive damage on the target."}
{"spell_name": "Chase Jackal", "spell_type": "Shakudo Magic", "spell_description": "The user manifests multiple jackals that are made of shakudo. The jackals then chase after and attack any target.[1]"}
{"spell_name": "Trace Mirage", "spell_type": "Fire Magic", "spell_description": "With an opengrimoire, the user generates a haze of heat around someone and shows them visions of their past. The memories are not limited to events that the user has witnessed.[1]"}
{"spell_name": "Dark Cloaked Deep Black Blade", "spell_type": "Dark Magic", "spell_description": "With their power boosted byShadow Magic, the user coats aMistilteinn Bladein darkness and then swings the blade at a target. The strike is strong enough to cause minor damage to theKing of Devils.[1]"}
{"spell_name": "Wild Bursting Flame", "spell_type": "Fire Magic", "spell_description": "With an opengrimoire, the user thrusts their hand downwards and a burst of flames manifest on the ground, surrounding the user.[1]"}
{"spell_name": "Noad Nephesh", "spell_type": "Reincarnation Magic", "spell_description": "The user suspends the souls of the dead[1]so that they may be reincarnated centuries later. This spell requires a large amount ofmagicand can be cast a far distance away from the targets. The user could also use it to suspend their own soul.[2]"}
{"spell_name": "Evil Eye", "spell_type": "Reincarnation Magic", "spell_description": "The user connects a soul to a collection ofmanaand inserts it into a living body.[1]The host's soul is forced to sleep,[2]and awakening it can break the spell.[3]"}
{"spell_name": "Dark Cloaked Dimension Slash", "spell_type": "Dark Magic", "spell_description": "With an opengrimoire, the user channels darkness into a sword and, with a downward slash, releases that darkness which flies at the opponent. The slash is able to cut through large clouds ofmana,Spatial Magic, and even space itself.[1][2][3]"}
{"spell_name": "Dark Cloaked Black Warrior", "spell_type": "Dark Magic", "spell_description": "With an openscroll, the user coats a sword and their body in darkness, which takes the appearance of samurai armor consisting of shoulder guards, armored sleeves, a chest plate, an armored skirt, amenpo, and a helmet crest. On the user's back is a large crescent, which matches the smaller ones on other parts of the armor.[1]"}
{"spell_name": "Sekke Poison Lizard", "spell_type": "Bronze MagicCurse Magic", "spell_description": "With an opengrimoire, the user creates a lizard that emerges from inside of the grimoire. The lizard is covered in a dark-colored matter and is composed of bronze and can move as if it is a living being. Upon its creation, the user can command it to move towards the target.[1]"}
{"spell_name": "Joyful Destructive Ash", "spell_type": "Ash MagicCurse Magic", "spell_description": "With an opengrimoire, the user gathers ash around them and creates spheres of concentrated ash. The user then launches these ash-based bullets towards their target.[1]"}
{"spell_name": "Another Atlas", "spell_type": "Compass Magic", "spell_description": "With an opengrimoire, the user creates a small compass in front of them and large compass face above an area. The needle on the small compass spins rapidly, which is mirrored by the needle on the large compass. As they spin, themanain the area beneath the large compass is disrupted, causing other spells to dissolve and disperse while also impeding others' magic. The user's magic is unaffected.[1]"}
{"spell_name": "Dusk", "spell_type": "Dark Magic", "spell_description": "Similar toBlack Hole, the user holds out their hand and creates a small black hole over their palm. The suction draws in and absorbs other spells and could be used to immobilize opponents.[1][2]"}
{"spell_name": "Dark Cloaked Black Blade Blunt Sweep", "spell_type": "Dark Magic", "spell_description": "With an opengrimoire, the user coats a sword in darkness and extends the blade by shaping the darkness. They then swing the blade wide and push a target back with the blunt side of the sword.[1]"}
{"spell_name": "Talos Puppet Cluster", "spell_type": "Crystal MagicCreation Magic", "spell_description": "With an opengrimoire, the user creates multiple crystal-based clones in their likeness. Subsequently, the user is able to use these clones to attack multiple targets at once without the need to directly control each and every one of them.[1]"}
{"spell_name": "Heavy Armored Titan", "spell_type": "Crystal MagicCreation Magic", "spell_description": "With an opengrimoire, the user's body is covered by crystals from the shoulders down forming armor. The crystals take a humanoid shape, complete with arms and legs. The surface of it is very amorphous with sharp crystals protruding at different directions.[1]"}
{"spell_name": "Super Sekke Magnum Cannonball", "spell_type": "Bronze MagicCreation Magic", "spell_description": "With an opengrimoire, the user manifests an improvedSekke Magnum Cannonball, which has a larger front cannon and additional spheres attached to the sides.[1]"}
{"spell_name": "Useless North", "spell_type": "Compass Magic", "spell_description": "With an opengrimoire, the user creates a dark sphere ofmanawith a large compass needle suspended inside. The user chooses a target and the needle moves to point at that target and is then launched from the sphere. The needle will pursue the target over any distance[1]and can identify the true target's location in a crowd of copies.[2]"}
{"spell_name": "Willful Compass", "spell_type": "Compass Magic", "spell_description": "With an opengrimoire, the user creates a large compass in front of a target. Any incoming attack is redirected in the direction of the compass's needle. Redirecting multiple spells requires creating multiple compasses.[1]"}
{"spell_name": "Talos Puppet", "spell_type": "Crystal MagicCreation Magic", "spell_description": "With an opengrimoire, the user creates a puppet composed of crystal and in the shape of the user. The puppet has enough hardness and density that it could easily withstand the piercing force of a steel lance and break the lance."}
{"spell_name": "Sheep Cook: Master Chef", "spell_type": "Cotton MagicCreation Magic", "spell_description": "With an opengrimoire, the user manifests aSheep Cookwith a toque, a mustache, a neckerchief,[1]and a pair of curved horns.[2]"}
{"spell_name": "Sludge Erosion", "spell_type": "Black Earth MagicCreation Magic", "spell_description": "With an opengrimoire, the user corrupts an opponent's earthen spell, turning it black and taking control of it. They can then turn the spell back against the opponent.[1]"}
{"spell_name": "Sheep Cook", "spell_type": "Cotton MagicCreation Magic", "spell_description": "With an opengrimoire, the user manifests an entity in the shape of a sheep. The sheep is composed of bundles of cotton with complete sheep anatomy and a chef hat.[1]More than one can be created at a time.[2]"}
{"spell_name": "Malevolent Femcantation", "spell_type": "Curse-Warding Magic", "spell_description": "The user sacrifices the souls of three powerful mages of the same sex to create a bridge between the underworld and the living world, enabling adevilto completely manifest itself.[2]"}
{"spell_name": "Nemean Armor", "spell_type": "Crystal Magic", "spell_description": "With an opengrimoire, the user forms a set of armor consisting of a breast plate, spaulders, gauntlets, and greaves. The armor is composed of crystals with some of them protruding from the surface, thus creating a rough and amorphous surface.[1]"}
{"spell_name": "Sleeping Sheep Strike", "spell_type": "Cotton MagicCreation Magic", "spell_description": "With an opengrimoire, the user generates countless amounts of cotton and molds them into the shape of a ram. The ram is of considerable size with a pair of horns and limbs without hoofs.[1]"}
{"spell_name": "Crystal Scope", "spell_type": "Crystal Magic", "spell_description": "The user creates a helm that has two telescopes built within the helm to accurately location a target with. The helm also has a strap that is connected to a mic that allows the user to speak with their allies.[1]The spell can also determine the physical condition of a target.[2]"}
{"spell_name": "Sheep Fluffy Cushion", "spell_type": "Cotton MagicCreation Magic", "spell_description": "With an opengrimoire, the user creates a large ram out of cotton. It can pull back its belly and launch an object at high speeds.[1]"}
{"spell_name": "Clones of the Beautiful Me", "spell_type": "Cherry Blossom Magic", "spell_description": "With an opengrimoire, the user creates multiple clones composed of cherry blossoms and in the user's likeness. They are so lifelike that they can trick even experiencedMagic Knights.[1]"}
{"spell_name": "Dance of 100 Million Cherry Blossoms", "spell_type": "Cherry Blossom Magic", "spell_description": "With an opengrimoire, the user creates a large folding fan made of cherry blossoms. Swinging the fan launches multiple streams of cherry blossoms, which are extremely sharp and can invade any defenses with small openings.[1]"}
{"spell_name": "Decaying World", "spell_type": "Curse-Warding Magic", "spell_description": "The user generates numerous strands of runes that can dismantle and destroy opponents' spells, wrap around and bind opponents, and apply curses. While this spell is active, anyrune arraysthat are applied to or directed at the user become corrupted and weakened.[1]However, spells of significant power and speed can be too large to weaken completely.[2]"}
{"spell_name": "Unbound Slave", "spell_type": "Curse-Warding Magic", "spell_description": "After placingrune arrayson another person's head, the user takes control of the person's body and forces them to unleash their magic. The magic is laced with curse power, increasing its strength.[1]"}
{"spell_name": "Sekke Magnum Cannonball", "spell_type": "Bronze MagicCreation Magic", "spell_description": "With an opengrimoire, the user manifests a transparent sphere around himself. The sphere has several peaks at random positions. It also has an intricate pattern across its surface.[1]"}
{"spell_name": "Exploding Life", "spell_type": "Curse-Warding Magic", "spell_description": "The user detonates the devil power that they have bestowed in the target. Twomagic circlesappear around a dark mass in the target's stomach, meanwhile the target's body swells as their magic power builds up inside of them. The target begins to shine right before they become a massive explosion.[1]"}
{"spell_name": "Sheep Bondage", "spell_type": "Cotton MagicCreation Magic", "spell_description": "With an opengrimoire, the user creates several ropes made of cotton. These ropes wrap around the target and secure themselves to the surrounding environment, leaving the target immobilized and hanging in the air.[1]"}
{"spell_name": "Sekke Shooting Star", "spell_type": "Bronze MagicCreation Magic", "spell_description": "With an opengrimoire, the user manifests a bicycle-like construct completely composed of bronze with intricate patterns covering the surface. The head tube of the bicycle's frame has a statue of the user as an ornament with a pair of wings that cover the handle bars that are positioned behind them. Similar pair of wings but larger in size could also be seen at the rear, behind the seat. The bicycle frame also has a pair of tubes protruding to the sides that could be used by the users to place their feet. Lastly, the wheels are made of a pair of bronze spheres with similar patterns covering their surface and they are connected to the frame by magical power.[1]"}
{"spell_name": "Magic Cherry Blossom Blizzard", "spell_type": "Cherry Blossom Magic", "spell_description": "With an opengrimoire, the user generates a large amount of cherry blossoms that can cover an entire battlefield. This spell is capable of not only rendering enemies unable to sense the user and their allies but also blocking enemies' spells.[1][2]"}
{"spell_name": "Mucus Nail", "spell_type": "Mucus MagicCreation Magic", "spell_description": "With an opengrimoire, the user creates a large snail made of mucus with the user at its center. The magic can capture individuals and anyone that is caught is weakened until they die.[1]"}
{"spell_name": "Scaffold of Fresh Blood", "spell_type": "Blood MagicCreation Magic", "spell_description": "With an opengrimoire, the user releases a large amount of blood, which covers the ground. Large bubbles form, hovering over the surface, and crucifixes rise up and restrain those individuals within range. On the crucifixes, the individuals affected have their wrists and stomachs bound.[1]"}
{"spell_name": "Laevateinn", "spell_type": "Crystal MagicCreation Magic", "spell_description": "With an opengrimoire, the user creates an enormous sword with three points and composed entirely of crystal structures. The blade of the sword itself has a very amorphous surface where it is made out of roughly cut crystals, except for the edges where it has a smooth surface. The sword's guard and grip have a similar texture as the blade with a rough sphere-shaped pommel at the end. Additionally, two large crystals can be seen embedded at the center of the fuller near the guard and the points.[1]"}
{"spell_name": "Magic Draining Roots", "spell_type": "Tree MagicCreation Magic", "spell_description": "With an opengrimoire, the user summons roots from under the ground near the target. The roots grow in such speed that they immediately surround the target.[1]"}
{"spell_name": "Lifeblood Scythe", "spell_type": "Blood MagicCreation Magic", "spell_description": "With an opengrimoire, the user shapes a large amount of blood into a giant scythe, which the user swings by hand.[2]"}
{"spell_name": "Magic Binding Iron Chain Formation", "spell_type": "Chain MagicCreation Magic", "spell_description": "With an opengrimoire, the user creates several chains, which wrap themselves around the target's torso several times and embed their arrow-tipped ends into the ground or walls, thus holding the target in place."}
{"spell_name": "Corpse-Hunting Briar Tree", "spell_type": "Briar MagicCreation Magic", "spell_description": "With an opengrimoire, the user unsheathes their weapon and transforms it into several prickle-covered vines, which extend to considerable length as they surround the user.[1]"}
{"spell_name": "Curse Candle Ritual Disk", "spell_type": "Black Oil MagicCreation Magic", "spell_description": "With an opengrimoire, the user shapes a large amount of black oil into a map that details the surrounding area. Locations withcursesare indicated by candles, which burn brighter in proportion to the strength of the curse. Increasing the range of the map may lower the accuracy of the readings.[1]"}
{"spell_name": "Dance of the Pitless Viper", "spell_type": "Chain MagicCreation Magic", "spell_description": "With an opengrimoire, the user creates several chains, which can be manipulated at will, and hurls them towards the target. The tips of the chains manifest into a snakes' heads, which attack the target from multiple directions at the same time.[1]"}
{"spell_name": "Curse-Filled Nails", "spell_type": "Black Oil MagicCreation Magic", "spell_description": "With an opengrimoire, the user shapes black oil into long fingernails on one of their hands. Upon contact with a person, these fingernails allow the user to sense the person's physical condition, including body temperature and magic power.[1]"}
{"spell_name": "Iron Bullet", "spell_type": "Iron MagicCreation Magic", "spell_description": "With an opengrimoire, the user forms a large iron casing around their arm and then thrusts their arm toward their target. Propelled bymana, the casing is launched from the user's arm and explodes on contact.[1]"}
{"spell_name": "Harpe", "spell_type": "Crystal MagicCreation Magic", "spell_description": "Upon activating the spell, multiple blades in a shape of a harpe would manifest around the users. Additionally, the users are able to freely manipulate it without the need of any direct contact with them.[1]"}
{"spell_name": "Ash Absorbing Formation", "spell_type": "Ash MagicCurse Magic", "spell_description": "With an opengrimoire, the user extends streams of cursed ash from their hands. These streams drain themanaof those who touch them, and the user absorbs this mana. Victims undergo rapid physiological wasting and eventually death."}
{"spell_name": "Big Boar Rampage", "spell_type": "Red Ochre MagicCreation Magic", "spell_description": "With an opengrimoire, the user creates a large boar made from red ochre and rides it as it charges forward. The charge is powerful enough to break through a large wall and even wound multiple opponents.[1]"}
{"spell_name": "March of Holy Fools", "spell_type": "Earth Magic", "spell_description": "With an opengrimoire, the user creates numerous human-shaped figures from the ground and puppeteers them to fight in the user's place. They have fast regenerative abilities and fight with their bare hands.[1]"}
{"spell_name": "Mud Wall Partition", "spell_type": "Earth Magic", "spell_description": "With an opengrimoire, the user slams their hands on the ground, and a large earthen wall rises from the ground. The wall is several feet thick and several stories high.[1]"}
{"spell_name": "Bright Armor Heavy Artillery", "spell_type": "Red Ochre MagicCreation Magic", "spell_description": "With an opengrimoireand having already encased themselves within an armor made of red ochre, the user extends their arms towards a target and fires chunks of red ochre from their hands.[1]"}
{"spell_name": "Rising Ground", "spell_type": "Earth Magic", "spell_description": "With an opengrimoire, the user kneels and holds their hands to the ground, and a series of large columns protrudes from the ground and crashes into the target.[1]"}
{"spell_name": "Divided Mother Earth", "spell_type": "Earth MagicCreation Magic", "spell_description": "With an opengrimoire, the user summons multiple golems that consist solely of earth from underfoot. The golems are highly muscular with a simple design and smaller thanRampaging Mother Earth.[1]"}
{"spell_name": "Rampaging Mother Earth", "spell_type": "Earth MagicCreation Magic", "spell_description": "With an opengrimoire, the user summons a golem that consists solely of earth from underfoot. The golem is highly muscular with a simple design and is strong enough to crush the user's target with its mere hands.[1]The user could choose to create multiple smaller golems, instead of one large one.[2]"}
{"spell_name": "Witch Hunter Claws", "spell_type": "Earth Magic", "spell_description": "With an opengrimoire, the user creates a giant mole composed of earth. This mole is capable of swiftly digging underground and ambushing targets from behind. Its grip is quite strong and is capable of crushing an adult.[1]"}
{"spell_name": "Mud Wall Cliff", "spell_type": "Earth Magic", "spell_description": "With an opengrimoire, the user slams their hands on the ground and raises the height ofMud Wall Partition.[1]"}
{"spell_name": "Dark Cloaked Avidya Wild Slash", "spell_type": "Dark Magic", "spell_description": "With an opengrimoire, the user coats their sword in Dark Magic and swings it in a disorderly fashion, creating multipleDark Cloaked Avidya Slashes.[1]"}
{"spell_name": "Dark Cloaked Avidya Slash", "spell_type": "Dark Magic", "spell_description": "With an opengrimoire, the user channels darkness into their sword and releases that darkness with a slash that flies at the opponent.[1]The wave of darkness retains the same sharpness as an edged weapon[2]and also has the ability to absorb other spells, such asLight Magic, while in mid-flight.[3]"}
{"spell_name": "Giant King of Wisdom", "spell_type": "Earth Magic", "spell_description": "With an openscroll, the user covers themselves with a massive amount of ground, creating a gigantic earthen body with which to fight. When also boosted byZetten, a single punch can shatter the head of a monstrously large dragon.[1]"}
{"spell_name": "Ground Wall", "spell_type": "Earth Magic", "spell_description": "The user kneels and touches their fingertips to the ground, and a large earthen wall rises from the ground. The wall is several stories high and several meters thick.[1]"}
{"spell_name": "Dark Cloaked Avidya Blunt Strike", "spell_type": "Dark Magic", "spell_description": "With an opengrimoire, the user coats their sword with Dark Magic, dashes behind their target, and strikes the target's nape with the back of their sword. The blow is strong enough to knock the target unconscious, and since it is done with the blunt side of the sword, the target is not grievously injured.[1]"}
{"spell_name": "Dirt Clod Seal", "spell_type": "Earth Magic", "spell_description": "With an opengrimoire, the user drops a large mass of earth on their opponent, burying them and restricting their movement.[1]"}
{"spell_name": "Black Crescent Moon", "spell_type": "Dark Magic", "spell_description": "With an openscroll, the usercoats themselves and their sword in darknessand then swings their sword, releasing a wide flying slash of darkness. When boosted byZetten, the slash is capable of cleanly slicing through the neck of a monstrously large dragon.[1]"}
{"spell_name": "Soul Chain Tag Deathmatch", "spell_type": "Fire MagicAnti Magic", "spell_description": "The user activates the spell by throwing two fireballs at their two opponents. When the fireballs connect with their targets, they explode and leave behindmagic circlesthat generate fiery chains which connect to similar arrays on the chests of the user and an ally, with all four chains connected to a black fireball between the two sides. These chains are made from their souls and evenly split the total magic power of those connected. The spell ends when both participants on one side die or lose consciousness, at which point the chains and magic circles dissipate.[1]"}
{"spell_name": "Spiral Flame", "spell_type": "Fire Magic", "spell_description": "With an opengrimoire, the user generates flames from the palm of his hands. The flames come out in a spiraling motion, which creates a tornado-shaped blast of flames. In order to use it against his targets, the user simply holds his arms in the targets' directions. The flame's intensity is enough to incinerate completely anything in its path.[1]"}
{"spell_name": "Timed Explosion Scattershot", "spell_type": "Fire Magic", "spell_description": "With an opengrimoire, the user generates multiple fireballs at once and throws them as a barrage of attacks on a wide area. These fireballs explode after a set period of time and deliver extensive damage to the target.[1]"}
{"spell_name": "Dark Cloaked Black Blade", "spell_type": "Dark Magic", "spell_description": "With an opengrimoire, the user coats a sword in darkness and shapes the darkness into a longer blade, extending its reach.[1]"}
{"spell_name": "Black Star", "spell_type": "Dark Magic", "spell_description": "With an openscroll, the user creates a small black sphere which strongly pulls in the target. This can be used to disrupt an opponent's movements, creating an opening."}
{"spell_name": "Black Hole", "spell_type": "Dark Magic", "spell_description": "With an opengrimoire, the user creates a small black hole which draws in and absorbs other spells.[1][2]It then shortly paralyzes the user of that spell if they are somehow in contact with their spell. However, the hole's size is limited to about five meters.[3]"}
{"spell_name": "Soul Chain Deathmatch", "spell_type": "Fire Magic", "spell_description": "The spell's full-body array"}
{"spell_name": "Sol Linea", "spell_type": "Fire Magic", "spell_description": "With an opengrimoire, the user manifests a small sun-like sphere of concentrated flame and then manipulates the sphere to shoot an intense beam of fire towards a target. The beam has enough power to pierce through a barrier made of a defense magic spell. Once the beam hits, it ignites the target, and the user can manipulate the fire to incinerate the rest of the target.[1]"}
{"spell_name": "Black Cocoon", "spell_type": "Dark Magic", "spell_description": "With an opengrimoire, the user creates a spherical shell of darkness around themselves.[1]"}
{"spell_name": "Shining Flame Cross", "spell_type": "Fire Magic", "spell_description": "With an opengrimoire, the user creates multiple small explosions that all take the form of a large cross.[1]"}
{"spell_name": "Ignis Columna", "spell_type": "Fire MagicCreation Magic", "spell_description": "With an opengrimoire, the user generates a pillar of spiraling flames around him. This pillar of fire rises from the user's feet to a certain height, which reduces the possibility of the user being attacked from above.[1]"}
{"spell_name": "Leo Rugiens", "spell_type": "Fire MagicCreation Magic", "spell_description": "With an opengrimoire, the user generates a great amount of fire which takes the shape of a lion. This lion-shaped fire is of such a considerable size that the user could mount it."}
{"spell_name": "Black Blade Shadow Strike", "spell_type": "Dark Magic", "spell_description": "Similar toDark Cloaked Black Blade, the user coats their sword in darkness, increasing the strength of its slashes.[1]"}
{"spell_name": "Guiding Light Leopard", "spell_type": "Fire MagicCreation Magic", "spell_description": "With an opengrimoire, the user manifests a leopard that is made of fire. It is capable of performing any of the user's commands as if it were a living creature.[1]"}
{"spell_name": "Extreme Killing Vanishing Fireball", "spell_type": "Fire Magic", "spell_description": "With an opengrimoire, the user generates a fireball in the palm of his hand and throws it as a projectile weapon towards the target. When the fireball nears the target, it disappears and then reappears, striking the target from another angle. This jump allows the fireball to move around the target's defenses.[1]Although the fireball disappears visually, itsmanacan still be felt, so mages with high sensing abilities could track the movement.[2]"}
{"spell_name": "Explosive Reheating", "spell_type": "Fire Magic", "spell_description": "With an opengrimoire, the user points at their target and engulfs it in flames. The heat is intense enough to char a pile of pies completely in seconds.[1]"}
{"spell_name": "Prison Kill Buckshot", "spell_type": "Fire Magic", "spell_description": "With an opengrimoire, the user generates multiple fireballs at once and can throw those fireballs as a barrage of attacks on a wide area.[1]"}
{"spell_name": "Exploding Fireball", "spell_type": "Fire Magic", "spell_description": "With an opengrimoire, the user generates a fireball in the palm of his hand. Subsequently, the user can throw it as a projectile weapon towards the target.[1]"}
{"spell_name": "Exploding Buckshot", "spell_type": "Fire Magic", "spell_description": "With an opengrimoire, the user generates multiple fireballs at once and can throw those fireballs as a barrage of attacks on a wide area."}
{"spell_name": "Hellfire Incarnate", "spell_type": "Fire Magic", "spell_description": "With an opengrimoire, the user assimilates a large amount of Fire Magic into their body, which begins to glow and takes on a fire-like appearance, almost as if it has become Fire Magic itself. The user's strength is greatly enhanced, enabling them to punch aside the limbs of a giant demon and to knock it onto its back.[1]The longer this spell stays active, the more potent it becomes.[2]"}
{"spell_name": "Calidus Brachium Purgatory: Flame Burial", "spell_type": "Fire Magic", "spell_description": "After prolonged usage ofHellfire Incarnate, the user'sflamesgrow in intensity, which the user can then focus into an even more powerfulCalidus Brachium.[1]"}
{"spell_name": "Flame Spike", "spell_type": "Fire Magic", "spell_description": "With an opengrimoire, the user creates an orb of fire in between their hands. Once released the orb expands and grows spikes around it. The spell also has a rope of fire attached to it but it is unknown if the user can control the spell with this rope.[1]"}
{"spell_name": "Calidus Brachium", "spell_type": "Fire Magic", "spell_description": "The user surrounds their fist with a fiery aura and punches the opponent, engulfing them in flames.[1]"}
{"spell_name": "Grand Slam", "spell_type": "Fire MagicCreation Magic", "spell_description": "With an opengrimoire, the user manifests a baseball bat from swirling flames. It could be used to knock fireballs toward an opponent[1][2]or as a melee weapon.[3]"}
{"spell_name": "Explosive Vanishing Scattershot", "spell_type": "Fire Magic", "spell_description": "With an opengrimoire, the user generates multipleExtreme Killing Vanishing Fireballsat once and throws them as a barrage of attacks on a wide area. These fireballs explode on contact and deliver extensive damage to the target.[1][2]"}
{"spell_name": "Burst Javelin", "spell_type": "Fire Magic", "spell_description": "The user creates a javelin made of fire that is able to damage a large crystal. Combined with a magic bow, the javelin can be launched as a long-range attack.[1]"}
{"spell_name": "Combo Eruption", "spell_type": "Fire Magic", "spell_description": "With an opengrimoire, the user spreads their arms wide and creates a series of fireballs, which are then launched at a target. These fireballs expand and then explode on contact.[1]"}
{"spell_name": "Catoblepas's Evil Eye", "spell_type": "Eyeball Magic", "spell_description": "With an opengrimoire, the user manifests numerous floating eyes and spreads them out over a large area. These eyes allow the user to see from multiple angles and over great distances as well as to perceive the target's magic, stamina, and muscle movements. This information allows the user to predict the target's actions and more accurately snipe the target.[1]"}
{"spell_name": "Area Helix", "spell_type": "Vortex Magic", "spell_description": "With an opengrimoire, the user generates a large sphere of spiralingmana. This sphere is capable of hovering in midair and holding backgiant creatures."}
{"spell_name": "Red Beast", "spell_type": "Blood Magic", "spell_description": "With an opengrimoire, the user expels a large amount of blood and shapes it into the upper body of a large creature with clawed hands, a gaping mouth, and no eyes. It is dense enough to withstand powerful offensive spells,[1]and its claws are sharp enough to tear apart defensive spells and humans.[2]Immersing the beast in large amounts ofwaterwill dilute and dissolve it.[3]"}
{"spell_name": "Bind Vine", "spell_type": "Vine MagicTrap Magic", "spell_description": "With an opengrimoire, the user generates vines from their body and buries them in the ground. When enemies approach, the vines spring up, entangle them, and drain theirmana.[1]"}
{"spell_name": "Scarlet-Braided Beautiful Battle Spear", "spell_type": "Briar Magic", "spell_description": "With an opengrimoire, the user creates several strands of briars and twists them together into the shape of a giant spear with a large rose at the end of the shaft. The user then launches the spear by making a throwing motion with their hand.[1]"}
{"spell_name": "Heavy Chain", "spell_type": "Chain Magic", "spell_description": "With an opengrimoire, the user creates a chain with a large spherical weight. The weight is dense and heavy enough to smash through rocks.[1]"}
{"spell_name": "Puppet Bloodflow", "spell_type": "Blood Magic", "spell_description": "After the user has used their magic on an individual, the user is capable of controlling that individual through their blood. While the spell is activated, the individual experiences intense pain and their eyes become white.[1]"}
{"spell_name": "Herd of Red Beasts", "spell_type": "Blood Magic", "spell_description": "With an opengrimoire, the user expels a large amount of blood and shapes it into multipleRed Beastswhich are smaller in size and have whole bodies. These beasts are also not attached to the user, allowing them to have a greater range of movement.[1]"}
{"spell_name": "Rhinoceros Armor", "spell_type": "Beast Magic", "spell_description": "With an opengrimoire, the user generates a magic aura around their body. The aura takes the shape of a rhinoceros and is able to stop powerful impacts.[1]"}
{"spell_name": "Holy Hunting", "spell_type": "Beast Magic", "spell_description": "With an opengrimoireand purifieddevilpower, the user surrounds their body with a magic aura that greatly enhances their speed, as well as forming around their hands like claws. The user then blitzes the target and claws at them. If the initial dash misses, the user could use the increased speed to ricochet around the target before launching another attack, and the user's momentum further increases the strength of their strikes.[1]"}
{"spell_name": "Revelation of the Cowardly", "spell_type": "Ash Magic", "spell_description": "With an opengrimoire, the user touches their allies with streams of ashes and enables the allies to know the positions where the user has setTrap Magic.[2]"}
{"spell_name": "Scorpio Chain", "spell_type": "Chain Magic", "spell_description": "With an open grimoire, the user creates a weighted chain that can extend to any length and can pursue a target. It is strong enough to break through multiple mirrors without losing speed.[1]"}
{"spell_name": "Bear Claw", "spell_type": "Beast Magic", "spell_description": "With an opengrimoire, the user surrounds their arms with a magic aura shaped like the paws and claws of a bear. The aura greatly enhances the strength of the user, allowing punches to break swords.[1]"}
{"spell_name": "Bogeyman", "spell_type": "Beast Magic", "spell_description": "With an opengrimoire, the user summons an imp that takes on the appearance of the target's fear. When summoned, the imp appears as a small black creature with smoke streaming from his eyes and back. The smoke then swirls around its body before taking shape. The transformation can draw from and trigger repressed memories of which even the target was unaware."}
{"spell_name": "Holy Howling", "spell_type": "Beast Magic", "spell_description": "With an opengrimoireand purifieddevilpower, the user lets out a howl that awakens a sleeping beast and allows the user to control the beast. The beast'smagic powerand body are also purified and altered in the process,[1]granting it incredible regenerative abilities.[2]"}
{"spell_name": "Cheetah Charge", "spell_type": "Beast Magic", "spell_description": "With an opengrimoire, the user wraps their legs and feet with a magical aura shaped like the legs of a cheetah. This aura greatly enhances the speed of the user, allowing them to close distances with extreme speed.[1]"}
{"spell_name": "Demon-Slasher: Infinite Slash Equinox", "spell_type": "Anti Magic", "spell_description": "Aftermerging with Liebe, the user raises theDemon-Slasher Katanaabove their head and then performs a downward slash, which produces a massiveAnti Magicflying slash. The attack can travel for miles without losing its edge, and the slash will not injure the user's allies even if they are in the path of the attack.[1]"}
{"spell_name": "Demon-Slayer Sword: Black Divider", "spell_type": "Anti Magic", "spell_description": "While wielding theDemon-Slayer Sword, the user pushes and condenses theAnti Magicto the edges of the blade.[1][2]Its size and reach can extend to several times its normal size.[3][4]Like other Anti Magic attacks, it is drawn toward magic, making it difficult for mages to dodge.[5][6]"}
{"spell_name": "Voodoo Regalia", "spell_type": "Barrier Magic", "spell_description": "With an opengrimoire, the user shapes a barrier into a weapon, which can then be fired as a projectile or wielded by hand. Various weapons can be crafted, such as arrows, swords, axes, and tridents, and the user can create multiple different weapons simultaneously.[1]"}
{"spell_name": "Demon-Slasher Katana", "spell_type": "Anti Magic", "spell_description": "The katana is summoned out of an openedgrimoire, inside which it is stored in the form of writing. The user can easily summon the katana at will without consuming any magical power.[3]"}
{"spell_name": "Voodoo Shangrila", "spell_type": "Barrier Magic", "spell_description": "With an opengrimoire, the user creates numerous hexagonal barriers and pieces them together to form a large dome. This barrier blocks both entrance and exit from the contained space and is particularly resilient against attacks.Spatial Magiccan be used to escape the dome, however the effectiveness of the magic is effected slightly by the barrier itself.[1]"}
{"spell_name": "Black Asta", "spell_type": "Anti Magic", "spell_description": "Black Asta's initial appearance"}
{"spell_name": "Black Hurricane", "spell_type": "Anti Magic", "spell_description": "Aftercoating their body with Anti Magic, the user spins rapidly and is pulled toward magic spells, which are dispelled by the swingingDemon-Slayer Sword. This spell is capable of nullifying an entire field of magic and magical traps in an instant.[1]"}
{"spell_name": "Demon-Dweller Sword: Black Slash", "spell_type": "Anti Magic", "spell_description": "While holding theDemon-Dweller Sword, the user fills the sword withAnti Magic, swings it, and releases the energy as a flying slash which cuts through magic and carries enough force to knock an opponent down, back into a wall or up through a ceiling. The slash does not appear to cut the opponent, but can knock them unconscious."}
{"spell_name": "Bull Thrust", "spell_type": "Anti Magic", "spell_description": "After being flung through the air, the user points both theDemon-Slayer SwordandDemon-Dweller Swordin front of themselves. Any spells or magic lifeforms that are in front the user are dispelled after coming in contact with the swords. The user is also incapable of changing direction without the help of aSpatial Magicuser.[1]"}
{"spell_name": "Black Meteorite", "spell_type": "Anti Magic", "spell_description": "Aftercoating their body with Anti Magic,[1]the user charges towards a target, dealing a powerful slash once they are in range.[2]"}
